{
  "contract_id": "1a996441cbab6826",
  "filename": "inter21-22.pdf",
  "file_hash": "1a996441cbab682684e082fc91ec6ec56ed4515fa43ed17ce91b9c285ef56945",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": 180000.0,
      "confidence": 0.9,
      "source_text": "INR 15,000 per month",
      "page_number": 25,
      "method": "regex"
    },
    "notice_period_days": {
      "value": 15,
      "confidence": 0.9,
      "source_text": "15 days notice",
      "page_number": 25,
      "method": "regex"
    },
    "bond_amount_inr": {
      "value": 100000.0,
      "confidence": 0.9,
      "source_text": "Liquidated Damages:\na. For the purpose of providing training and placing trainee, the Company is\nincurring training expenses of approximately Rs.1,00,000",
      "page_number": 42,
      "method": "regex"
    },
    "non_compete_months": {
      "value": 3,
      "confidence": 0.9,
      "source_text": "NON-COMPETE & NON-SOLICITATION\nYou agree that during your employment with Terobots Enterprise AI Private Limited, and continuing\nfor a period of twelve (12) months after termination of your employment with Terobots Enterprise AI\nPrivate Limited., you will not individually or on behalf of or in conjunction with any other person or\nentity (except on behalf of Terobots Enterprise AI Private Limited., directly or indirectly, solicit to, or\nperform similar services as provided by or available from Terobots Enterprise AI Private Limited, for\nany clients of Terobots Enterprise AI Private Limited, Will not seek and obtain employment, training,\nor contract for employment or seek to serve as you or other wise to clients of Terobots Enterprise AI\nPrivate Limited, customers, accounts or prospects, without the written permission of Terobots\nEnterprise AI Private Limited, Will not directly or indirectly solicit or hire or cause others to solicit or\nhire any others employee of Terobots Enterprise AI Private Limited unless pre-approved by Terobots\nEnterprise AI Private Limited, in writing. You will not, during the period of this assignment, prepare,\ncompile, submit or publish any articles or contribute to any other publication or television\nserials/films/video presentations or assist anyone directly or indirectly in this regard. Further you have\nvoluntarily agreed to sign an undertaking letter in this regard.\n9.0 UN-AUTHORIZED ABSENCE\nAbsence without leave or remaining absent beyond the period of leave originally granted or\nsubsequently extended, shall result in voluntary termination of your employment without any notice\nunless you\na) Return to work within 3 days from the commencement of such absence, and\nb) Provide satisfactory explanation to management regarding such absence.\n10.0 TERMINATION\nThe Employer / Intern may terminate the internship with or without cause and should support for 30\nDays\n11.0 Full time role : Upon completion of internship and delivering performance as per company\nexpectations, you will be converted to full time role\n12.0DECLARATIONS\nThis is to confirm that the documents and information provided by me to Terobots Enterprise AI Private\nLimited. for the purpose of employment are true and accurate to the best of my knowledge and belief. I\nalso agree that the various terms and conditions set forth in this Agreement are fair, just and reasonable\nand I shall strictly adhere to the terms and conditions specified.\nLooking forward for successful completion of your internship with our organization.\nYours faithfully\nFor Terobots Enterprise AI Private Limted\nSrikanth Ravinutala Supriyo Chowdhury\nDirector Intern Name and Signature\n\nDate: 23rd December,2021\nInternship Offer Letter\nTo,\nYashwant Kumar\nDear Yashwant,\nWe at Tollplus India Pvt Ltd are extremely delighted to inform you that you have been selected for the\nInternship training program conducted by our company, for the position of Software Engineer Trainee.\nYou will be Reporting to Mr. Sheo Narayan (Director Technology) at Hyderabad during the Internship\ntraining program. Here are the terms and conditions of internship while working with the Company:\n1. Duration of internship will be from 16th February 2022 Until 30th April 2022.\n2. You will be designated as “Software Engineer Trainee” and will be entitled for a stipend\npayment of INR 33,000/ Month.\n3. You will not be entitled for any other benefits from the company during this tenure.\n4. During your Internship your Performance will be evaluated as per the assessments\nconducted regularly from time to time and you are expected to qualify in all the assessment\ntest conducted during training and post completion of training period.\n5. Internship may be terminated at any point if found unsatisfactory.\n6. During internship, you are expected to the abide to the “Code of Conduct” policy prescribed\nby the Company.\nKindly confirm your acceptance of this Internship offer letter within 5 working days else the offer will\nbe revoked and will be automatically considered to be cancelled.\nPlease feel free to contact us in case of further details. Wishing you good luck for your future endeavours.\nBest Wishes,\nFor TollPlus India Pvt. Ltd.\nSanjay Kumar. M\nSenior Manager - Human Resources,\nTollplus India Private Limited.\n\nDocuSign Envelope ID: E4A9DCE0-E1C6-43E0-8D3B-9914664EF3ED\nOffer Letter\nFurther to your application and interview with Revature, we are pleased to offer you a\nposition of Software Engineer Trainee in our organization.\nThis Offer Letter (the or this “Agreement”) is entered into by and between\n_S_a_y_y_a_d_ _A_s_i_f_________ (“Software Engineer Trainee” or “Trainee”), aged\n_2_2____________years, S/O or D/O _S_/_O_._S_a_y_y_a_d_ _J_a_l_a_l_u_d_d_i_n_residing\nat _D_._N_o_:_4_-_6_3_,_ _P_a_l_l_a_d_i_v_a_r_i_ _S_t r_e_e_t_,_ _M_u_t_y_a_l_a_m_m_a_ _T_e_m_p_l_e_,_ _R_a_j_a_n_a_g_a_r_a_m_,_ _E_a_s_t_ ,G oadnadv Rareiv aDtiusrter ict, 533294.\nConsultancy Services Private Ltd, (“Company”), a company having its registered office at\n12th Floor, New No.431, Anna Salai, Teynampet, Chennai - 600 018. Trainee and Company\nmay each be individually referred to hereinafter as a “Party” or collectively as the\n“Parties.”\nCompany provides full-time training for real-world tech careers at the world’s top\ncompanies. Revature software engineers have industry-recognized certifications that are\nhard to achieve. During Revature’ s training program, software engineers are taught skills\nand competence to hit the ground running. After they successfully complete the training,\nRevature works with the individual to get them hired directly with Revature’ s clients. The\ntotal training to hire process typically takes about four months.\nNOW THEREFORE, in consideration of the mutual promises contained herein and for other\ngood and valuable consideration the receipt and sufficiency of which the Parties\nacknowledge, the Parties hereby agree as follows:\n1. Internship/Revature Readiness Program (RRP):\na. Trainee Internship/RRP is for a minimum period of three (3) months. During\nthis period, Trainee will receive a stipend of Rs.5,000/- (Rupees Five\nThousand Only) per month. He/ She will be provided with a mentor during the\nInternship/RRP period\nb. This Program is a 12-week instructor-led training program designed to\nprovide Trainees with skills and knowledge that can be built upon advance\nand acquire the skills of a software developer. The training program is a\nresidential program, provided at no cost to eligible Trainees accepted into\nthe training program.\nc. During the term, Trainee undertake to devote best efforts, knowledge and\nskill and devote substantially all their working time (at least 40 hours a week)\nand attention to the performance of duties.\nd. During Training, trainees will learn the skills that will set them on the career\npath, working on the most highly sought-after technologies in the tech\nindustry.\n30 Dec 2021 Ver 1\n\nDocuSign Envelope ID: E4A9DCE0-E1C6-43E0-8D3B-9914664EF3ED\ne. As part of our ongoing commitment to continued learning and development,\nCompany has designed this Internship/RRP to be a mentor-led training\nprogram that enables trainees to get introduced to various emerging\ntechnologies. As they are entering the IT Industry, it is important to have a\nstrong foundation in Programming languages, Databases and Operating\nSystems and Behavioral skills.\nf. Trainee performance will be tracked periodically and provide feedback when\nnecessary. Upon successful completion of 12-week Internship/Revature\nReadiness Program, trainees will be required to clear the final review with\nRevature’ s Client(s) that includes an assessment and one to one interaction.\ng. Detailed description of training details is given in the Training Agreement.\nh. All Trainees will be required to agree to, abide by and adhere to the rules of\nuse and policies in (or referenced in) Training Agreement.\ni. Attendance: Trainers will accurately report trainees training hours and\nCompany will not encourage, require, or permit trainees to skip trainings or\nabsence from trainings or falsify training hours.\nj. Accommodation: In COE – Centre of Excellence, Company will provide free\nor no cost hostel accommodation for trainees based on company’s discretion.\nSeparate hostel facilities will be provided for men and women trainees. Safety\nof every trainee is of utmost importance to Company. Residential Trainees are\ndirected to follow hostel rules & regulations strictly and any deviation will be\ndealt strictly. Detailed description of Hostel rules & regulations are given in\nthe Hostel Agreement. This clause is applicable only for Residential Trainees.\nk. Program Disclaimers\nRevature reserves the right to remove Trainees from the program for any\nreason during the course of the program including, but not limited to,\nattendance, performance, or conduct, or to discontinue the program at any\ntime without notice on an as-needed basis.\n2. Appointment after Internship/RRP:\na. After clearing the final review with the client(s) that includes an assessment\nand one to one interaction, at the sole discretion of client and Revature and in\naccordance with the terms in Training Agreement, trainee may be offered an\nemployment as “Software Engineer” by the Client.\nb. By accepting this offer Trainee acknowledges and assures that he/she will\ncontinue to remain in the employment of the Company’s Client for a minimum\nperiod of eighteen months (18) (“hereinafter called minimum\n30 Dec 2021 Ver 1\n\nDocuSign Envelope ID: E4A9DCE0-E1C6-43E0-8D3B-9914664EF3ED\nperiod/mandatory period) from the date of appointment with the Client. He\n/She further agrees and acknowledges that, in the event Trainee voluntarily\nresign and/or are terminated from the services of client, for any lawful\nreasons whatsoever, client shall incur substantial loss, including, but not\nlimited to, finding a suitable replacement, training, project continuity, etc.\nc. Company will have made commitments to its Clients, it is imperative that\nTrainee, once appointed to a Client, remains employed there for the\nmandatory period.\n3. Compensation:\na. Trainee will receive a stipend of Rs.5,000/- (Rupees Five Thousand Only) per\nmonth during the Internship/Revature Readiness Program.\nb. Upon successful completion of 3 months",
      "page_number": 38,
      "method": "regex"
    },
    "probation_months": {
      "value": 4,
      "confidence": 0.9,
      "source_text": "probation based\non your performance.\nBy accepting this offer letter, you agree that throughout your employment, you will\nobserve all policies and practices governing the conduct of our business and\nemployees. This letter sets forth the complete offer we are extending to you and\nsupersedes and replaces any prior inconsistent statements or discussions. Official\ncommunication either within the company or outside the company should be\nthrough the official Email of the HR only.\nWorking Hours: 9 Hours a day (Inc. Lunch and evening Break)\nJob Type: Full Time Training\nReporting Location: Hyderabad\nTo indicate your acceptance, please mail the signed and scanned soft copy the\nTraining Offer Letter and the documents as mentioned below to the\nsupport@zelfstudie.in within 1 working day from the receipt of this mail. The\noffer shall stand automatically withdrawn without further action on the part\nof ZelfStudie Edutech, if we do not receive your acceptance as per the mentioned\ntimeline.\nAcceptance of the Candidate.\nI have read and understood the above terms and conditions and I accept this offer,\nas set forth above, with ZelfStudie Edutech, and will report on 28 April 2022\nSignature: ___________ Date: ___________\n(Candidate’s Signature)\nA wonderful experience awaits you here, that’s a promise!\nRR Towers, Plot 188,189, Kavuri hills phase 2 Madhapur\nsupport@zelfstudie.in +91 78992 57545\nHyderabad 500081\nPAN: BVFPN5295P GSTN: 36AABCZ8416B1ZF CIN: U80300TG2021OPC156418\n\nAnnexure-1\nProfessional / Educational Certificates and Mark Sheets :\n10 th standard or equivalent examination\n12 th standard or equivalent examination\nGraduation\nPost-graduation / Doctorate Other relevant educational or skill\ncertifications\nPAN Card, Aadhar card, Voter ID or Driving License Scanned Copy.\nPhotograph scanned copy.\nBank Account Details: Bank Name, Your Name as per Bank records,\nAccount Number, IFSC Code.\nRR Towers, Plot 188,189, Kavuri hills phase 2 Madhapur\nsupport@zelfstudie.in +91 78992 57545\nHyderabad 500081\nPAN: BVFPN5295P GSTN: 36AABCZ8416B1ZF CIN: U80300TG2021OPC156418\n\n\n\n\n\n\n\n04/03/2022, 18:18 https://wipro.icims.com/forms?module=Forms&action=showForm&view=htm&form=Unpaid_intern_template_without_start_a…\nMarch 4, 2022\nDear Ravanam Sravani,\nSub: Letter of Engagement as Intern\nWe are pleased to inform you that you have been selected for undergoing Internship in our organization Wipro Limited\n(Wipro) as Intern under the following terms and conditions:\n1. Nature of Engagement\nYou will be engaged as an Intern at Wipro.\n2. Duration of training\nThe duration of internship will be 10 to 16 weeks",
      "page_number": 26,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "Notwithstanding any of the clauses of this letter of engagement, Wipro reserves the right in its sole discretion of\nterminating this agreement during the training period without assigning any reason by giving one week’s (7 days) notice\nor payment of one week’s stipend, in lieu of notice.",
        "evidence": {
          "value": 288,
          "confidence": 0.7,
          "source_text": "Termination\nNotwithstanding any of the clauses of this letter of engagement, Wipro reserves the right in its sol",
          "page_number": 32,
          "method": "regex"
        }
      },
      "ip": {
        "text": "No trademark, patent, copyright, trade secret or other\nintellectual property or proprietary right is licensed, granted or otherwise conveyed,\neither expressly or by implication, by the disclosure of Confidential Information",
        "evidence": {
          "value": 223,
          "confidence": 0.7,
          "source_text": "Intellectual Property\nNo trademark, patent, copyright, trade secret or other\nintellectual property or proprietary right is",
          "page_number": null,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "time in the Confidentiality Policy of Wipro, as secret and confidential and do not use or disclose any such",
        "evidence": {
          "value": 107,
          "confidence": 0.7,
          "source_text": "Confidentiality Policy of Wipro. Therefore, please maintain all Confidential Information as defined from time to\ntime in the Confidentiality Policy of Wipro, as secret and confidential and do not use or disclose a",
          "page_number": 31,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 159
}