{
  "contract_id": "1acfb3407cf55917",
  "filename": "NRL24202262338PM_Ann_B_Provisional_Agreement_DDD_Reseller_NRL.pdf",
  "file_hash": "1acfb3407cf559179a163871585b907393ecaf8cdd90ed6e375eb6816f509272",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "notice_period_days": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "bond_amount_inr": {
      "value": 10.0,
      "confidence": 0.9,
      "source_text": "Payments\n7.1. FuelEnt will be supplied HSD from NRL’s Supply location situated at Numaligarh/Siliguri,\nFuelEnt shall be sold HSD at Ex-Supply Location price of the Company’s Supply\nLocations which shall be decided on day to day basis by the Company.\n7.2. The sale of HSD to FuelEnt shall be purely on advance payment basis.\n7.3. All tax liabilities / license fee / statutory payments shall be borne by FuelEnt.\n8. Statutory and Tax compliances\n8.1. Compliance of Provisions in Essential Commodities Act, Control Orders and other\nstatutory requirements of PESO, Weights & Measures, Motor Vehicles Act Taxation, labour\nlaws, applicable State and Central government laws etc. would apply to FuelEnt. All\nstatutory approvals and Licenses have to be obtained by the FuelEnt in their name and\nwill carry out periodic renewal of such statutory licenses / approvals as per the\nrequirement of statutory norms at their own cost.\nPage 5 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\n9. Process\n9.1. Filling/Loading of Mobile Dispenser\n9.1.1. The Mobile Dispenser shall be filled, at the Supply Location as endorsed in PESO License\nof the Mobile Dispenser and as specifically advised by NRL in writing from time to time.\n9.1.2. Standard Operating Procedures for loading HSD into Mobile Dispenser at NRL’s\nSupply Location form integral part of this agreement which is more specifically described\nunder in Annexure I and as amended from time to time. FuelEnt will keep itself\nupdated on the said guidelines from PESO office / PESO website.\n9.2. The Mobile Dispenser of FuelEnt may be filled one or more times in one day from the\nSupply Location as endorsed in PESO license.\n9.3. Filling of mobile dispenser shall be carried out through Flow meters installed at the\nNRL’s Supply Locations.\n10. Supply of HSD to Identified Customers\n10.1. FuelEnt shall resell the HSD only for those equipment in line with the Petroleum\nAmendment Rules, 2019 as notified by Ministry of Petroleum and Natural Gas in Gazette\nof India: Extraordinary dated May 29th, 2019.\n10.2. For Standard Operating Procedures for dispensing HSD through Mobile Dispenser at\nrefueling sites of identified customers, FuelEnt will abide by the guidelines specified by\nPage 6 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\nPESO as amended from time to time. FuelEnt will keep itself updated on the said\nguidelines from PESO office / PESO website\n10.3. The FuelEnt shall strictly follow all provisions of the above mentioned Standard Operating\nProcedures.\n10.4. The selling price of HSD can be decided by the FuelEnt on the basis of mutual agreement\nwith the identified customer. NRL shall not be a party to any dispute arising out of the\nselling Price or other liability(ies) between the FuelEnt and its identified customer.\n10.5. The FuelEnt shall sell / supply HSD though the Mobile Dispenser to refueling sites only of\nthe Identified Customers.\n11. General\n11.1. FuelEnt shall have no right to use the NRL’s brand, trademark, logo in any form.\nFuelEnt shall not represent itself as NRL’s representative or agent or franchisee or\nin any other capacity other than the one created in this agreement.\n11.2. FuelEnt shall not make any commitments or guarantees on behalf of NRL.\n11.3. FuelEnt shall not sell, assign, sublet, mortgage, charge, or part, or otherwise transfer his\nrights or interest or benefit conferred under this Agreement.\n11.4. It is further agreed by the FuelEnt that it shall not publish any advertisement or press\nrelease or make any statements in any media including social media using NRL’s name\n/ brand / trademark/logo without prior written permission from the Company.\n11.5. SOPs (Annexure 1) form integral part of this agreement. FuelEnt declares that it has\nunderstood and agreed to the SOPs.\nPage 7 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\n12. Covenants\n12.1. Mobile Dispenser\n12.1.1. The FuelEnt shall operate the Mobile Dispenser at its own cost, risk and expense, which\nshall include any toll charges and fuel expenses, any other expense as per statutory\nrequirements or guidelines issued by the Govt. authorities.\n12.1.2. The FuelEnt shall keep the Mobile Dispenser and its surroundings in a safe, clean and\nsatisfactory condition.\n12.1.3. The FuelEnt shall not replace/ detach/ remove any component of the Mobile Dispenser,\nexcept for the purposes of fueling / filling / maintenance. Any change in the design of\nthe Mobile dispenser will have to be approved by PESO and RTO and amended in the\nlicense before it is put to use again.\n12.1.4. The FuelEnt shall be responsible for the maintenance, service and repair of the Mobile\nDispenser at its own cost.\n13. Parking\n13.1. The FuelEnt shall ensure that the Mobile Dispenser is parked at the PESO approved Parking\nSpace only. FuelEnt has to arrange parking space for Mobile Dispenser as per Form XIX,\nat its own cost.\n14. Crew\n14.1. The Crew of the mobile dispenser of the FuelEnt shall at all times work under the\nsupervision and control of the FuelEnt.\n14.2. The FuelEnt shall be responsible for compliance of Motor Vehicles Act and all applicable\nlabour laws in respect of the deployment and functioning of its Crew.\nPage 8 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\n14.3. The FuelEnt shall ensure that its Crew abides by the terms and conditions of this\nagreement, the terms and conditions of PESO Licenses, as applicable and other\nStandard Operating Practices issued from time to time by NRL / other statutory\nauthorities.\n14.4. Mobile Dispensers shall be deployed, maintained and operated through trained crew by\n“FuelEnt” at their own cost. Trained crew should be able to operate safety equipments\nand handle exigencies\n15. Representations and Warranties :\n15.1. These representations and warranties shall survive the execution and delivery of this\nAgreement. The FuelEnt represents and warrants to NRL that:\n15.1.1. The FuelEnt is and shall continue to be in compliance with all applicable Laws.\n15.1.2. The FuelEnt have obtained all licenses, permissions, consents, approvals and\nauthorizations from government / statutory authorities required under law, and all\nmanagement and shareholder approvals necessary to enable the FuelEnt to perform its\nobligations under this Agreement and all such necessary approvals, licenses, permissions,\nconsents, approvals and authorizations are valid and effective, and covenants that the\nsame shall remain valid and effective through the period and shall obtain any additional\napprovals, licenses, permissions, consents and authorizations that are required to enable\nNRL to perform its obligations under this Agreement.\n15.1.3. The FuelEnt is not under any liquidation, court receivership, or any similar legal\nproceedings nor any other steps have been taken or notice received for its winding-up\nor dissolution.\n15.1.4. The FuelEnt have in place/shall have the requisite Mobile Dispenser(s) with necessary\nfixtures, facilities to perform its obligations under the Agreement, and shall maintain the\nadequacy of its Mobile Dispenser(s) with necessary fixtures, facitlies during the period of\nthis Agreement, without any cost to NRL.\nPage 9 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\n15.1.5. The FuelEnt have clear right, title and interest to the Mobile Dispenser(s) and NRL can\nperform its obligations under this Agreement without any charge, claim to the Mobile\nDispenser/s from any third party.\n15.1.6. The FuelEnt shall not undertake or allow any ‘Change in Constitution’. ‘Change in\nConstitution’ shall mean; (a) change in partner(s) of partnership firm or a limited liability\npartnership, (b) change in member of a private limited Company, or (c) change in it’s\nlegal status.\n15.2. The FuelEnt further represents and warrants to NRL that:\n15.2.1. It is duly incorporated and validly existing under the laws of its place of incorporation and\nhas the power, capacity and authority to own its assets and to conduct its business as\ncontemplated herein;\n15.2.2. This Agreement has been duly executed by it and is a legal, valid and binding document\nenforceable against it in accordance with its terms;\n15.2.3. The execution of this Agreement does not violate any law;\n15.2.4. It shall always act as a reasonable and prudent FuelEnt;\n15.2.5. It confirms that all its representations and warranties set forth in this Agreement are\nindependent of each other and true, complete and correct in all respects at the time as\nof which such representations and warranties were made or deemed made, and shall\ncontinue to have full effect during the period of this Agreement; and\n15.2.6. It has the necessary power to perform its respective obligations under this Agreement.\nPage 10 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\n16. Indemnity\n16.1. FuelEnt shall indemnify and keep indemnified and hold harmless NRL from and against all\nlosses, claims, suits or other legal liability and legal expenses of any nature imposed\nupon or brought against it by reason of any act or omission of the FuelEnt or its Crew,\nagent, or employees in the course of performance under the Terms and conditions of this\nAgreement.\n16.2. FuelEnt shall at all times indemnify and keep indemnified NRL, its officers, employees,\nand agents against all losses, damages, liabilities, suits, actions, legal proceedings,\nclaims, demands, or otherwise howsoever arising out of any claims made by the central\nand/or state government and/or municipal local and/or other competent authorities\nand/or Customers and/or any third party as a result of or in consequence of any act or\nomission of whatsoever nature of FuelEnt, his servants or agents including without\nprejudice to the generality of the foregoing, any accident or loss or damage/injury to\nlife and/or property arising out of storage, handling, and/or sale of HSD or attributable to\nthe use of Mobile Dispenser for the aforesaid purposes whether or not such act or\nomission or accident or loss or damage was due to any negligence, want of care or skill\nor any misconduct of the FuelEnt, Crew, servants, or agents.\n17. Insurance\n17.1. FuelEnt shall purchase Public Liability Insurance to cover public loss arising out of\naccidents to be valid during the currency of this agreement.\n17.2. FuelEnt shall at all times, and from time to time take out adequate and proper insurance,\nwith respect to the Mobile Dispenser during the validity of these terms and conditions.\n17.3. FuelEnt shall be guided by the terms and conditions of the insurance policies and ensure\nthat its act of omission or commission does not in any manner impair or dilute the\ninsurance policies or extent of coverage thereof.\nPage 11 of 17\n\nANNEXURE B\nPROVISIONAL\nFUELENT AGREEMENT\nFOR HSD DELIVERY THROUGH MOBILE DISPENSER\n17.4. FuelEnt shall at all times, and from time to time procure and maintain at its sole cost and\nexpense, insurance policies including product insurance, fire insurance, financial\ninsurance, third-party liability insurance, and any additional insurance as may be\nrequired or available to cover the liability of the FuelEnt in relation to the risks assumed\nby the FuelEnt under this Agreement and also the liability of the FuelEnt to indemnify\nNRL, its officers, employees, and agents in accordance with the Agreement.\n18. Term and Termination\n18.1. The Agreement shall come into effect as on the Effective Date. The Agreement shall\nremain valid for a period of 10 [Ten] years from the Effective date, unless terminated\nearlier in terms hereof.\n18.2. The Agreement shall terminate prior to the validity period upon occurrence of any of the\nfollowing events;\n18.2.1. FuelEnt commits a breach or defaults in any of the provisions of the Agreement\n18.2.2. FuelEnt party is subject to any insolvency and or bankruptcy proceedings and or winding\nup.\n18.2.3. Any direction of Central / State Govt. to such effect.\n18.2.4. Any proven breach of violation of statutory norms. Breach investigated and proved by\nGovt. officials.\n18.2.5. Changes in business scenario leaving",
      "page_number": 5,
      "method": "regex"
    },
    "non_compete_months": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "probation_months": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "extracted_clauses": {
      "confidentiality": {
        "text": "23.1. Each Party shall keep strictly confidential and shall not disclose to any third party the\ncontents of this Agreement without prior permission from disclosing party.",
        "evidence": {
          "value": 170,
          "confidence": 0.7,
          "source_text": "Confidentiality\n23.1. Each Party shall keep strictly confidential and shall not disclose to any third party the\ncont",
          "page_number": 14,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 53
}