{
  "contract_id": "49f6c085e790adc5",
  "filename": "Vishal Genpact........pdf",
  "file_hash": "49f6c085e790adc529d8e4799580276c4ecf240cdf882f7377878306a60d484b",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": 260000.0,
      "confidence": 0.9,
      "source_text": "2.6 lakhs",
      "page_number": 7,
      "method": "regex"
    },
    "notice_period_days": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "bond_amount_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "non_compete_months": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "probation_months": {
      "value": 3,
      "confidence": 0.9,
      "source_text": "probation for six months from the date of joining, which may be extended by the Company at its discretion.\nYour services at the end of the Probation period shall be treated as confirmed, unless specifically extended by the company in\nwriting. During the probation period, either party may terminate this contract by giving 60 (Sixty) days' notice in writing in the\nmanner referred to in clause 9 or payment of 60 days salary in lieu thereof. If you chose not to serve the notice period, if\napplicable, the Company also reserves the right to recover from you all expenses incurred with regard to any training and\ndevelopment, special education, up skilling or on the job training provided to you in the course of your employment with the\nCompany in addition to notice pay. However the Company reserves the right not to accept payment in lieu of notice and at its\nsole discretion enforce the notice period.\nGenpact India Private Limited\nCIN: U73100DL2005PTC307363\nRegd. Off.: 12A (Ground Floor) Prakash Deep Building 7,\nTolstoy Marg, New Delhi-110001\n\n8. Notice to terminate this contract will be accepted by the Company only when it is issued in a form wherein your identity is\nascertainable (such as hard copy letter with original signatures). Notice of termination in electronic form where such identi ty\ncannot be ascertained such as SMS or personal email shall not be accepted as adequate notice of termination for the\npurposes of this agreement.\n9. Post confirmation, your services may be terminated by either party, giving notice in writing as mentioned in clause 8 for 60\n(Sixty) days or payment of salary in lieu thereof. If you chose not to serve the notice period, if applicable, the Company\nreserves the right to recover from you all expenses incurred with regard to any training and development, special education,\nup skilling or on the job training provided to you in the course of your employment with the Company in addition to notice pay.\nHowever the Company reserves the right not to accept payment in lieu of notice and at its sole discretion enforce the notice\nperiod.\n10. The Company reserves the right to terminate your employment on grounds of breach of policy, misconduct or where your\nperformance has been found to be unsatisfactory.\n11. Absence for a continuous period of eight days without prior approval of your supervisors, (including overstay of leave /\ntraining), would be treated as abandonment of service and can lead to your services being terminated without notice. In such\nan eventuality the Company reserves the right to recover from you, all expenses incurred with regard to any training and\ndevelopment, special education, up skilling or on the job training imparted by the Company or damages suffered by Company\ndue to loss of billing.\n12. You will automatically retire on attaining the age of 60 years.\n13. Whilst employed by the Company:\n• You will not be permitted to undertake any other full time or part time employment or engage in any external activities\nof a commercial nature without prior written approval.\n• You will be required to effectively carry out all duties and responsibilities assigned to you by your supervisors and\nothers authorized by the Company to assign such duties and responsibilities. Your performance evaluation will be\ndone periodically by your supervisors as per the Company appraisal system.\n• Except in the ordinary course of your employment, you shall not divulge to any third party any information regarding\nthe affairs or business matters of the Company or information regarding its customers without prior written approval.\nAll information that comes to your knowledge by reasons of your employment with the Company is deemed to be\nconfidential and any breach thereof, shall be deemed to be a violation of the Company policies and treated in\naccordance of clause\n• You confirm that there is no litigation /conviction against you before any Court of law which involves any criminal\noffence or offences involving moral turpitude.\n• You confirm that you have disclosed fully all of your business interests in the Company - whether or not they are\nsimilar to or in conflict with the business (es) or activities of the Company, and all circumstances in respect of which\nthere is, or there might be perceived, a conflict of interest between Genpact and you or any immediate relatives, Also,\nyou agree to disclose fully and immediately to the Company any such interests or circumstances which may arise\nduring your employment.\n• You will be required to apply and maintain the highest standards of personal conduct and integrity and keep yourself\ninformed and comply with all Company policies and procedures.\nGenpact India Private Limited\nCIN: U73100DL2005PTC307363\nRegd. Off.: 12A (Ground Floor) Prakash Deep Building 7,\nTolstoy Marg, New Delhi-110001\n\n14. Any violation of the above mentioned or any other Company procedures and policies would attract action as per\nCompany's disciplinary policy in force, including and up to termination. In the event of termination by Company on account of\nbreach of disciplinary policy, the Company will not be liable to any amount in lieu of notice.\n15. Upon separation from the Company on account of either resignation or termination, you will be required to immediately\nreturn to the Company, all assets and property (including any leased assets) of the Company including documents, files,\nbooks, papers, training material and memos whether in hard of soft copy which is in your possession or custody.\n16. The Company shall, at its discretion, conduct background, reference and medical checks including screens for substance\nuse as per company policy and this offer is conditional upon the result of such checks. In the event the results of such\nbackground / reference checks or screens for substance use are unsatisfactory on any account, the Company may, in its sole\ndiscretion, revoke this offer at any time.\n17. You are required to submit your relieving letter in original from your previous employer (if applicable) within 45 days of your\njoining the Company failing which your employment with the Company shall be liable for termination without prior notice.\n18. All terms and conditions will be governed by the Company's policies as stated from time to time and the Company may in\nits sole discretion as it deems fit revoke or change such policies.\n19. The terms of this offer shall be kept strictly confidential. You shall execute all other documents as may be required to give\neffect to this offer.\n20. Any and all disputes arising in connection with the appointment letter shall be referred to arbitration which shall be\nconducted in accordance with the Arbitration and Conciliation Act,1996 by a Sole Arbitrator appointed by the General Counsel\nof the Company. The venue of the Arbitration shall be Delhi and the language shall be English. You agree to submit yourself\nto the exclusive territorial jurisdiction of courts at Delhi.\nYour assignment is effective from Mar 15, 2024.\nKindly sign and return a copy of this letter. Please initial each page in acceptance of the terms and conditions set out herein\nlatest by 15 days from the issuance of the letter else this offer stands automatically withdrawn.\nWe welcome you and wish you every success in your career with Genpact.\nYou are requested to come on the joining date at 9:15 am at Genpact, India>Gurugram>Gurgaon Badshahpur - IN Office.\nWarm regards,\nFor Genpact India Pvt. Ltd. Accepted and Agreed\nRitu Bhatia\nSenior Vice President-HR VISHAL GOSWAMI\nGenpact India Private Limited\nCIN: U73100DL2005PTC307363\nRegd. Off.: 12A (Ground Floor) Prakash Deep Building 7,\nTolstoy Marg, New Delhi-110001\n\nAnnexure I\nListed below are the mandatory documents (in photocopy) you are required to furnish at the time of joining.\n1. Professional Relieving letter from previous employer (last employment) only.\n2. If already a member of a provident fund (PF) scheme with previous employer, then;\na. Employer's name\nb. Provident Fund account number from your previous employer\nc. Universal account number provided by your previous employer\nd. Employee Pension number provided by your previous employer\nOR\ne. Date of joining & leaving from previous employer\nf. Copy of Passport in case of International Workers(it should contain Nationality, Passport number, Country of issue,\nDate of issue, Valid up to)\n3. Below mentioned KYC (Know Your Customer) Documents\na. Copy of PAN\nb. Copy of Aadhaar Card.\nc. Signed Cancelled Cheque with your name printed on it (In case your name is not printed on the Cheque,\nplease attach last 3 months",
      "page_number": 1,
      "method": "regex"
    },
    "extracted_clauses": {}
  },
  "num_chunks": 48
}