{
  "contract_id": "4fcbd5eaa28f034a",
  "filename": "security_agency_job.pdf",
  "file_hash": "4fcbd5eaa28f034a030b1153bbe55bdc2ab7dde901c4d0dfd2f0414e6d10a008",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "notice_period_days": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "bond_amount_inr": {
      "value": 100.0,
      "confidence": 0.9,
      "source_text": "liquidated damages in the event of the\nbreach of the covenants as stipulated in terms of clause no.1 hereinabove, within a\nperiod of not more than seven (7) days from such demand being raised by the\nFSM upon the Security Agency.\n17. CONFIDENTIALITY AND NON –DISCLOSURE\na) All details, documents, paper, statements, business/customer information\nand FSM’s practices and trade secrets (hereinafter referred to as “Confidential\nInformation”) which may be communicated to the Security Agency and / or its\nemployees or coming into the possession of the Security Agency and / or its\nemployees shall be treated as absolutely confidential and the Security Agency\nirrevocably agrees and undertakes and ensures that the Security Agency and all\nits employees shall keep the same secret and confidential and not disclose the\nsame in Whole or Part to any person without written permission from the FSM nor\nshall use or allow to be used any information than as may be necessary for the\ndue performance of the Security Agency’s obligation hereunder. The Security\nAgency hereby specifically agrees to indemnify and keep the FSM indemnified\nsafe and harmless at all times against all or any consequences arising out of\nbreach of this undertaking by the security agency and / or its employees and shall\nimmediately reimburse and pay to FSM on demand, with out any protest and / or\ndemur all damages, loss, cost, expenses or any changes that FSM may suffer,\nincur or pay in connection therewith, within a period of seven days from such\ndemand being raised by the FSM upon the Security Agency.\nb) Take all necessary action to protect the confidential information against misuse,\nloss, destruction, deletion and / or alteration.\nc) Not to misuse or permit directly or indirectly, commercial exploit the confidential\ninformation for economic or other benefit that is not envisaged in terms of this\nAgreement.\nd) Not to make or retain any copies or record (in any form) of any confidential\ninformation submitted by FSM other than as may be required for the performance\nof the Security Agencies obligation under this agreement.\ne) Notify the FSM promptly of any unauthorized or improper use or disclose of the\ninformation.\nf) Return all information, which is in custody of the Security Agency at the end of the\nspecific assignment.\ng) The Security Agency hereby unconditionally agrees and undertakes that it and / or\nits personnel shall not disclose or publish the terms and conditions of this\nagreement or disclose the information’s submitted by the FSM under this\nagreement to any third party unless such disclosure is required by law. This\nobligation will also not apply to any information which:\n7\n\ni. at the time of disclosure is in the public domain\nii. after disclosure is published or otherwise becomes part of the public domain\nthrough no fault of the recipient of the information OR\niii. was in possession of the recipient at the time of disclosure and was not\nacquired directly or indirectly, from other party under an obligation of\nconfidence.\n18. TERM AND TERMINATION:\na) This agreement will be for a period of One Year (1 year) with effect from\n1st April 2018 to 31st March, 2019. The agreement can be renewed further for a\nperiod of One year (1 years) on the mutually agreed terms as to deployment of\nsecurity guards and consideration by exchange of letters. The FSM shall, in the\nevent of the Security Agency committing any breach of any of the terms and\nconditions of this agreement or if the services provided by the Security Agency is\nconsidered to be unsatisfactory by the FSM or for any other reason considered\nby the FSM sufficient, be entitled to terminate this agreement by giving one\nmonth’s notice in writing and the Security Agency shall not be entitled to any\ncompensation in case of such termination.\nb) The FSM may terminate the services of the Security Agency without assigning\nany reasons/cause by giving One Month’s Notice in writing to Security Agency\nand the Security Agency shall not be entitled to any compensation in case of\ntermination. On expiry or earlier determination of this agreement, the Security\nAgency and the Security Guards shall vacate the premises of the FSM without in\nany way causing any damage to the said premises.\n19. FEES AND CHARGES\na) In consideration of services rendered by the Security Agency, the FSM\nshall pay fees and charges in accordance with the terms and conditions\narrived between both the parties.\nb) The Security Agency shall raise a monthly bill on or before 5th every month\nupon the FSM towards the provision of the services as envisaged herein,\nbased on the attendance of its deputed security guards as duly verified by\nauthorized representative of the FSM. The FSM shall thereafter within a\nperiod of not more than 15 days, upon such due verification of the\nattendance of the security guards and the subsequent raising of the bill\nmake good the payment to the Security Agency.\nc) There shall not be enhancement in rates/ charges during the above period\nexcept necessitated due to enhancement of minimum wages by the Govt.\nand the consequent changes in the other charges due to the same. No\nother charges except as above and applicable government taxes shall be\npayable to the Security Agency.\nd) In lieu of the consideration thereof i.e. a fixed sum/rate the Security\nAgency will at its own risk and cost provide the services as envisaged\nherein as per the requirements of the FSM purely on a contractual basis.\n8\n\n20. PRINCIPAL TO PRINCIPAL AGREEMENT\nIt is agreed between both the parties that this agreement is on a principal-to-\nprincipal basis and does not create and shall not deem to create any employer-\nemployee relationship between the Security Agency and / or their Employees and\nthe FSM. The Security Agency shall not by any acts, deeds or otherwise\nrepresent to any person that the Security Agency is representing or acting as\nagent of the FSM except to the extent and purpose permitted herein.\n21. DISPUTE RESOLUTION\nIn case of any or differences between arising between the parties under this\nagreement, the same shall be referred to the Arbitration of Sole Arbitrator to be\nnominated by the FSM and that the decision of the Sole Arbitrator shall be binding\nupon both the parties. The Arbitration shall be conducted in accordance with the\nprovision of Arbitration and Conciliation Act 1996 and that the Arbitration shall be\nheld at Delhi. This Agreement shall be governed by and construed in accordance\nwith the laws of India and shall be subject to the exclusive jurisdiction of the\ncourts/tribunals in Delhi.\n22. TRAINING DETAILS.\na) The Security Agency will conduct training once in every month according to\nschedule of the agency.\nb) This manpower could be increased or decreased as per the requirement of\nFORE. However, FORE has to give a notice of 7 days for any such\nrequirement and the Security Agency will accordingly make arrangements.\nHowever, in case of indiscipline the change to be effected immediately.\nc) The Security agency shall change the guard/ supervisor provided to the\ninstitute by rotation or as and when called upon by the Institute to do so.\nd) The FSM shall be entitled to supervise the services provided by the Security\nAgency and if it finds that the conduct, behaviour and performance of work of\nany of its personnel so deputed is unsatisfactory, the FSM may at its sole\ndiscretion issue directions to the Security Agency to immediately recall the\nparticular person and substitute him by another person and the Security\nAgency shall comply with such directions issued by FSM forthwith.\n23. Place of Duty:\nFORE SCHOOL OF MANAGEMENT, B-18, QUTUB INSTITUTIONAL AREA,\nNEW DELHI-110016\n24. Earnest Money Deposit: The bidders shall enclose with the Proposal EMD\namounting to 5% of total value of contract in the form of Bank draft / Pay Order\ndrawn on any Nationalized/Schedule Bank in favour of the “FORE SCHOOL OF\nMANAGEMENT”, payable in Delhi.\n25. Period of Contract: The initial period of contract would be six months,\nextendable by another six months on satisfactory performance with such\namendments as may be mutually agreed to and also subject to the necessary\napproval of the competent authority. Service charges/rates quoted by the agency\nwould be fixed except any statutory increase. After satisfactory completion of a\n9\n\nyear of service, the contract can be extended for another year on the same terms\nand conditions with mutual agreement.\n26. General Conditions of Contract\na) The manpower will have to be supplied by the agency within 15 days of award of\ncontract.\nb) All services shall be performed by persons qualified and skilled in performing\nsuch services as per the eligibility criteria indicated for each category. All\nequipment/ machineries etc. shall be arranged by the bidder.\nc) The guards/ supervisors supplied by the Agency should not have any Police\nrecords/criminal cases against them. The Agency should make adequate\nenquiries about the character and antecedents of the persons whom they are\nrecommending. The character and antecedents of persons will be verified by the\nService Provider before their deployment through local police, collecting proofs of\nresidence, driving license, bank account details, previous work experience and\nrecent photograph and a certification to this effect submitted to this office. The\nservice provider will also ensure that the\npersonnel deployed are medically fit and will keep in record a certificate of their\nmedical fitness. The Service Provider shall withdraw such employees who are not\nfound suitable by the office for any reasons immediately on receipt of such a\nrequest.\nd) The service provider shall engage necessary persons as required by this office\nfrom time to time. The Deployment of personnel is to be on monthly basis. Thus\ndeployment/arrangement of the personnel should be in such a manner that there\nshall be no violations of any leave Rules and weekly off days. The security\nAgency will have to bear cost of providing personnel for this work load/ duty hours\nor weekly off. The said persons engaged by the service provider shall be the\nemployee of the service provider and it shall be the duty of the service provider to\npay their salary before 10th of every month.\ne) There is no Master and Servant relationship between the employees of the\nservice provider and this office and further that the said person of the\nservice provider shall not claim any absorption in this office.\nf) The service provider’s person shall not claim any benefit/ compensation /\nabsorption/ regularization of services from/in this office under the provision\nof Industrial Disputes Act., 1947 or Contract Labor (Regulation & Abolition)\nAct, 1970. Undertaking from the persons to this effect shall be submitted by\nthe service provider to this office.\ng) The service provider’s personnel shall not divulge or disclose to any person, any\ndetails of office, operational process, technical know-how, security arrangements\nand administrative / organizational matters as all are of confidential/secret nature.\nh) The service provider’s personnel should be polite, cordial, positive and efficient,\nwhile handling the assigned work. The service provider shall be responsible for\nany act of indiscipline on the part of persons deployed by him. The agency shall\nbe bound to prohibit and prevent any of their employees from being intoxicated\nwhile on duty, trespassing or acting in any detrimental or prejudicial to the interest\nof this office. The decision of the officer-in-charge upon any matter arising under\nthe clause shall be final and binding on the agency.\n10\n\ni) That the persons engaged shall not be below the age of 18 years or above the\nage of 50 years and they shall not interfere with the duties of the employees of\nthis office.\nj) The functional control over the personnel deployed by the Agency will rest with\nthis office and the disciplinary administrative / Technical control will be with the\nAgency.\nk) This office may require the service provider to remove from the site of work, any\nperson or persons, employed by the service provider, who may be incompetent or\nfor his/ her/their misconduct and the service provider shall forthwith comply with\nsuch requirements. The Service provider shall replace immediately any of its\npersonnel, if they are unacceptable to this office because of security risk,\nincompetence, conflict of interest and breach of confidentiality or improper\nconduct upon receiving written notice from office.\nl) The service provider has to provide Photo Identity Cards to the persons employed\nby him/her for carrying out the work. These cards are to be constantly displayed &\ntheir loss reported immediately.\nm) The transportation, food, medical and other statutory requirements in respect of\neach personnel of the service provider shall be the responsibility of the service\nprovider.\nn) That the agency will be wholly and exclusively responsible for payment of wages\nto the persons engaged by it in compliance of all the statutory obligations under all\nrelated legislations as applicable to it from time to time including Minimum Wages\nAct, Employees Provident Fund, ESI Act etc. and this office shall not incur any\nliability for any expenditure whatsoever on the persons employed by the agency\non account of any obligation. The agency will require providing particulars of EPF,\nESI of its employees engaged in this office. The Agency will comply all statutory\nprovisions of law, rules and regulations of Act and keep this office informed about\nany amendment in the law from time to time.\no) The service provider will submit the bill in triplicate to Director, FORE School of\nManagement, New Delhi – 110016 (pertaining to security work FORE institutional\ncomplex) in respect of a particular month in the first week of the next month. The\npayment will be released by the third week of the following month after subject to\ncertificate given by the Officer In-Charge and production of documentary evidence\ntowards P.F./ESI of its staff for the previous month. Tax if any shall be deducted\nat source as per the relevant Act.\np) Payments to the service provider would be strictly on certification by the AO/CAO\nthat his services were satisfactory and attendance as per the bill preferred by the\nservice provider.\nq) No wages/remuneration will be paid to deployed persons for the days of absence\nfrom duty.\nr) The service provider will provide the required personnel for a shorter period also,\nin case of any exigencies as per the requirement of this office.\ns) The service provider shall provide a substitute well in advance if there is any\nprobability of the person leaving the job due to his/her own personal reasons. The\npayment in respect of the overlapping period of the substitute shall be the\nresponsibility of the service provider.\n11\n\nt) The service provider shall be contactable at all times and messages sent by\nphone /e-mail/ fax / special messenger from this office shall be acknowledged\nimmediately on receipt on the same day. The Service Provider shall strictly\nobserve the instructions issued by the Administrative Officer or his representative,\nin fulfillment of the contract from time to time.\nu) This office shall not be liable for any loss, damage, theft, burglary or robbery of\nany personal belongings, equipment or vehicles of the personnel of the service\nprovider.\nv) That the Service Provider on its part and through its own resources shall ensure\nthat the goods, materials and equipment etc. are not damaged in the process of\ncarrying out the services undertaken by it and shall be responsible for acts of\ncommission and omission on the part of its staff and its employees etc. If this\noffice suffers any loss or damage on account of negligence, default or theft on the\npart of the employees/agents of the agency, then the agency shall be liable to\nreimburse to this office for the same. The agency shall keep this office fully\nindemnified against any such loss or damage. Any accident/ casualty occurred\nduring the course of working to any staff engaged by the Agency, the\nresponsibility will remain with the Agency. For any accident or casualty occurred\nduring the course of working to any staff deployed by the Agency, the liability that\nwill arise out of the accident will be borne by the Agency. The responsibility will\nremain with Agency and this office will no way be responsible for it or any other\nclause mentioned above.\nw) This office will maintain an attendance register in respect of the staff deployed by\nthe agency on the basis of which wages/remuneration will be decided in respect\nof the staff at the approved rates.\nx) The successful bidder shall furnish a security deposit equivalent to 5% of the\ncontract value in the form of an Account Payee Demand Draft drawn in favour of\nthe “FORE SCHOOL OF MANAGEMENT” payable at New Delhi or Fixed Deposit\nReceipt from a nationalized / commercial bank or Bank Guarantee from a\nnationalized / commercial bank in an acceptable form safeguarding the interest of\nthis office in all respects. The security deposit shall remain valid for a period of\nsixty days beyond the date of completion of all contractual obligations of the\nservice provider. The security deposit will be forfeited in case the supply of\nmanpower is delayed beyond the period stipulated by this office or non-\ncompliance of the terms of agreement by the service provider or frequent absence\nfrom duty/misconduct on the part of manpower supplied by the Agency.\ny) The successful bidder will enter into an agreement with this office for supply of\nsuitable and qualified manpower as per requirement of this office on these terms\nand conditions on non-judicial Rs. 100",
      "page_number": 7,
      "method": "regex"
    },
    "non_compete_months": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "probation_months": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "extracted_clauses": {
      "termination": {
        "text": "Agency and the Security Guards shall vacate the premises of the FSM without in\nany way causing any damage to the said premises.",
        "evidence": {
          "value": 127,
          "confidence": 0.7,
          "source_text": "termination. On expiry or earlier determination of this agreement, the Security\nAgency and the Security Guards shall vacate the premises of the FSM without in\nany way causing any d",
          "page_number": 8,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "a) All details, documents, paper, statements, business/customer information\nand FSM’s practices and trade secrets (hereinafter referred to as “Confidential\nInformation”) which may be communicated to the Security Agency and / or its\nemployees or coming into the possession of the Security Agency and / or its",
        "evidence": {
          "value": 307,
          "confidence": 0.7,
          "source_text": "CONFIDENTIALITY AND NON –DISCLOSURE\na) All details, documents, paper, statements, business/customer information\nand FSM’s practices and ",
          "page_number": 7,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 83
}