{
  "contract_id": "61436f0d9ff3845f",
  "filename": "5.2.1--(2021-22)-Sample-Placed-Evidence.pdf",
  "file_hash": "61436f0d9ff3845f2bb4669d573c5816fb63d479cd7546c59f47c5ea62e894be",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "notice_period_days": {
      "value": 30,
      "confidence": 0.9,
      "source_text": "30 days notice",
      "page_number": 10,
      "method": "regex"
    },
    "bond_amount_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "non_compete_months": {
      "value": 6,
      "confidence": 0.9,
      "source_text": "Non-Compete and Non-Solicit Restrictions\nRegd Office: 115/535, Old Mahabalipuram Road, Okkiam Thoraipakkam, Chennai - 600 097\n\nDuring the term of your employment with Cognizant and until two (2) years after the termination\nof such employment, you will not directly or indirectly, either as an individual on your own account\nor as a partner, employee, consultant, advisor, agent, contractor, director, trustee, committee\nmember, office bearer, or shareholder (or in a similar capacity or function), (a) solicit, attempt to\nsolicit, contact or otherwise encourage any employee to leave the Company's employment, (b)\nsolicit business from competitor(s) or client(s) of the Company or (c) be employed or engaged\nwith any competitor(s), or (d) be employed or engaged with any client(s) of the Company with\nwhom you have interacted or worked in a professional capacity representing the Company during\nthe six (6) months preceding the date of termination of your employment.\n10. Representations and Warranties\nBy signing below,\na. you warrant that your employment with the Company does not and will not violate or otherwise\nconflict with any agreement (oral or otherwise) to which you are or have been a party and that\nyou possess all the requisite permits, work visas and clearances to be able to lawfully and\nrightfully employed in India with the Company under the terms of this Agreement;\nb. you warrant that you have satisfactorily completed all of your obligations under any\nemployment contract or other contract or agreement with any company(ies), person(s) or entity\n(ies) that previously employed or contracted with you and that any previous employment contract\nand/or relationships have terminated and/or expired prior to the effective start date of your\nemployment at the Company and you have all the requisite power and authority, and do not\nrequire the consent of any third party to be employed with the Company;\nc. you represent and warrant that you shall not bring into Company premises or systems (or use\nin any manner) any third-party documents (regardless of media) or materials (including but not\nlimited to proprietary information or trade secrets), or any such documents or materials of your\nprevious employer, without written permissions/approvals from such previous employer or third\nparties; and\nd. you represent that unless authorized by the Company in writing, you shall not sign any contract\nor agreement that binds the Company or creates any obligation (financial or otherwise) upon the\nCompany.\n11. Indemnity\nYou agree to indemnify and hold harmless the Company and its affiliates from and against any\nand all direct or indirect losses or damages, injury or liability for a claim of damage, loss or injury\nto person or property, suffered or sustained by Company and its affiliates which is attributable to\nyou, resulting from any of your act or omission irrespective of whether it constitutes a breach of\nthe terms of your employment or negligent performance of your duties as expected from you\nwhile in employment of the Company.\n12. Business Engagement, Learning and Development and Project Deployment\nIn order to ensure that you are fully equipped to adapt to client needs, the Company has several\npolicies and processes relating to deployment of employees to projects, Career Architecture\nprogram, performance evaluation, learning and development/training and up-skilling\nopportunities. As a condition of your employment with the Company, you are responsible for\nupskilling yourself to make yourself eligible for appropriate business/client projects, thereby\npromoting the spirit of meritocracy and career development with the goal of providing world-class\nservices to our clients. Therefore, you shall adhere to and meet the obligations under all such\npolicies and processes, including the Associate Deployment Pool Policy and those that may be\nchanged by the Company from time to time.\nRegd Office: 115/535, Old Mahabalipuram Road, Okkiam Thoraipakkam, Chennai - 600 097\n\n13. Unauthorized Absence\nIf you are absent from work for a continuous period of three (3) days or as prescribed by\napplicable laws, without the prior written consent from your approving authority, it will be\nconstrued that you have voluntarily abandoned your employment with the Company. The\nCompany shall be entitled to take appropriate disciplinary action(s) against you as per the\nCompany's Job Abandonment Policy.\n14. Retirement\nYou will automatically retire from employment with the Company on the last day of the month in\nwhich you attain the age of fifty-eight (58) years. It is hereby clarified that the Company reserves\nits right to change the retirement age at its sole discretion.\n15. Termination of Employment\na. The Company may terminate your employment at any time with or without assigning any\nreasons by providing 90 days' advance notice to you by paying you pro rata salary in lieu of any\nnotice or balance notice period.\nYou may resign or terminate your employment with the Company by providing 90 days' advance\nnotice to the Company. When you serve notice to resign from employment with the Company, the\nCompany may at its sole discretion allow you to pay salary in lieu for the notice period; and/or\nadjust the vacation accumulated towards part of the notice period.\nb. Notwithstanding the aforesaid or anything else to the contrary, the Company may, at its sole\ndiscretion, suspend, lay off, dismiss, discharge and/or terminate your employment with immediate\neffect by a notice in writing (without any notice period or salary in lieu of any notice period) in the\nevent of your:\n• Misconduct, as provided in Misconduct and Disciplinary Action Policy\n• Non-adherence to Associate Deployment Pool Policy\n• Violation of Social Media Policy or Conflict of Interest Policy\n• Breach of integrity, embezzlement, misappropriation, misuse or causing damage to the\nCompany's assets/property or reputation\n• Insubordination or failure to comply with the directions given to you by persons so authorized\n• Insolvency or conviction for any offence involving moral turpitude\n• Breach of any terms or conditions of the Agreement and/or Company's policies or other\ndocuments or directions of the Company\n• Violation of non-disparagement obligations\n• Conduct regarded by the Company as prejudicial to its own interests or to the interests of its\nclient\n16. Deputation, Assignment and Transfer\nThe Company may second, depute or assign you to work with any of its affiliates or transfer your\nservices to any group company worldwide. On any such secondment, deputation, assignment or\ntransfer of your employment, the Company and/or affiliate may require you to sign the applicable\nOverseas Deputation/International Employment Agreement(s) of the specific country, based on\nthe policies of the Company.\n17. Survival\nClauses 4, 5, 9 and 11 and any other clauses, which by their nature are expected to survive, shall\nall survive the termination of your employment (for any reason) and shall continue to apply to you\neven after cessation of your employment with the Company.\nRegd Office: 115/535, Old Mahabalipuram Road, Okkiam Thoraipakkam, Chennai - 600 097\n\n18. Dispute Resolution and Governing law\nThe Parties shall make our best efforts to settle by mutual conciliation any claim, dispute or\ncontroversy (\"Dispute\") arising out of, or in relation to, this Agreement, including any Dispute with\nrespect to the existence or validity hereof, the interpretation hereof, or the breach hereof. This\nAgreement and your employment with the Company shall be governed and interpreted in\naccordance to the laws of India and the courts in Chennai only shall have exclusive jurisdiction\nover any Dispute. Notwithstanding the aforesaid, the Company shall be entitled, in addition to all\nother remedies, to any interim relief including but not limited to an injunction, whether\ninterlocutory or preliminary, restraining any breach of the provisions of this Agreement.\n19. General\nThis Agreement and your employment is personal to you and you cannot assign, subcontract or\ntransfer your rights or obligations hereunder to any other person or entity. No delay or failure by\nthe Company to exercise any of its powers, rights or remedies under this Agreement or otherwise\nwill operate as a waiver of such powers, rights or remedies. If any provision of this Agreement is\nheld by any competent authority to be invalid or unenforceable, the validity of the other remaining\nprovisions of the Agreement shall not be affected. You shall not make any announcement\nconcerning the Company, its affiliates and their employees, contractors or clients without the\nCompany's prior written consent, and you shall not use or disclose the name, trademark, domain\nname, service mark, logo or any other intellectual property of the Company and its affiliates and\ntheir employees, contractors or clients.\nThis Agreement, together with the agreements and policies of the Company, Employment Offer\nLetter (and any attachments thereto, are the exclusive and entire agreement between the Parties\nrelating to its subject matter, and supersedes all prior and contemporaneous discussions,\nagreements, negotiations, representations, and proposals relating to the subject matter hereof.\nYou shall be required to treat the terms of this Agreement as strictly confidential. The Company\nreserves the sole right to change any terms or conditions provided in this Agreement based on\napplicable laws or business exigencies.\nIN WITNESS WHEREOF, the Parties hereto have duly executed this Agreement as of the day\nand year first above written.\nCognizant Technology Solutions India Private Limited Parandha Sneha\nShibu Balakrishnan\nAVP – HR\nI have read, understood and accept the above-mentioned terms.\nSignature: Date:\nRegd Office: 115/535, Old Mahabalipuram Road, Okkiam Thoraipakkam, Chennai - 600 097\n\n\n\nDocuSign Envelope ID: D4C34C3F-5170-4C8D-A7A2-2608AF62F285\n08/15/2022\nDear Ruchitha Bagudem,\nCongratulations! We welcome you to the family of Sutherland!\nWith reference to the discussions, you had with us, we are pleased to make an Offer of\nEmployment with us as Associate-CS Internet in the Company. Please note that your\nemployment with us is contingent on subject to successful clearance of background verification.\nYou need to submit all relevant documents for background verification within seven (7) days\nfrom the date of appointment letter. In case you fail to submit the documents within the\nprescribed period, we will initiate necessary action against you as deemed as appropriate by the\nCompany including but not limited to revoking of this offer letter without any further liability to\nCompany. You are requested to join us on or before 08/16/2022 on the following terms and\nconditions.\nYour place of posting will be initially at Hyderabad. However, during your employment with\nus you may be posted or transferred/attached to any other units/companies/ offices or clients of\nThe Sutherland Group either in India or Abroad at the sole discretion of the Management.\nYour emoluments by way of Annual Cost to the Company is Rs. INR 225,000.00 /- per annum\n(Rupees Two Lakhs Twenty Five Thousand Rupees Only), the details of which are given in the\nannexure of the appointment letter.\nYou shall report to Srikanth AV of the company or any authorized person nominated by the\ncompany from time to time, who will in turn assign your role, duties and responsibilities in the\ncompany.\nYou may be required to work in shift system of the company as intimated to you from time to\ntime.\nYou are governed by the “Sutherland’s Code of Conduct as updated from time to time” of the\ncompany which are in force or may come in force from time to time. You will also execute a\nservice and confidentiality agreement as applicable to employees of your category from time to\ntime.\nYou would be on probation for a period of 6 months",
      "page_number": 113,
      "method": "regex"
    },
    "probation_months": {
      "value": 6,
      "confidence": 0.9,
      "source_text": "PROBATION PERIOD & CONFRIMATION OF EMPLOYMENT\n7.1. The Employee shall be employed on a probationary basis for a period of 6 months",
      "page_number": 3,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "9.1. The Employee’s employment with the Company may be terminated by either party giving to the other party\nnotice in writing or salary in lieu of notice as set out in Annexure A. In this case, the Employee shall not be\nentitled to leave pay.",
        "evidence": {
          "value": 242,
          "confidence": 0.7,
          "source_text": "TERMINATION\n9.1. The Employee’s employment with the Company may be terminated by either party giving to the othe",
          "page_number": 3,
          "method": "regex"
        }
      },
      "ip": {
        "text": "a. If during the course of his/her work for the Company (whether in the course of normal duties or not and\nwhether or not during normal working hours), the Employee makes, or participates in the making of any\ndesign (whether registered or not) or any work in which copyright and/or database rights subsist, the\nEmployee hereby assigns to the Company with full title guarantee and, where appropriate, by way of future\nassignment, all such rights for the full term thereof throughout the world, provided that the assignment\nshall not extend to those designs or works which are created by the Employee wholly outside his/her normal\nworking hours and wholly unconcerned with his/her service under this Agreement.\nb. All technology infrastructure of the Company and its employees, whether specifically licensed or furnished\nas part of The Company equipment rented, purchased or loaned and Software Service for them. Technology",
        "evidence": {
          "value": 921,
          "confidence": 0.7,
          "source_text": "INTELLECTUAL PROPERTY shall include\na. If during the course of his/her work for the Company (whether in the course of normal duties or n",
          "page_number": null,
          "method": "regex"
        }
      },
      "non_compete": {
        "text": "Regd Office: 115/535, Old Mahabalipuram Road, Okkiam Thoraipakkam, Chennai - 600 097\n\nDuring the term of your employment with Cognizant and until two (2) years after the termination\nof such employment, you will not directly or indirectly, either as an individual on your own account\nor as a partner, employee, consultant, advisor, agent, contractor, director, trustee, committee\nmember, office bearer, or shareholder (or in a similar capacity or function), (a) solicit, attempt to\nsolicit, contact or otherwise encourage any employee to leave the Company's employment, (b)\nsolicit business from competitor(s) or client(s) of the Company or (c) be employed or engaged\nwith any competitor(s), or (d) be employed or engaged with any client(s) of the Company with",
        "evidence": {
          "value": 759,
          "confidence": 0.7,
          "source_text": "Non-Compete and Non-Solicit Restrictions\nRegd Office: 115/535, Old Mahabalipuram Road, Okkiam Thoraipakkam, Chennai - 600 097\n\nDuring the ter",
          "page_number": 113,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "In consideration of an Employee’s employment with The Company, employees will be exposed to information and materials\nrelating to the affairs, transactions, operations, methods of doing business, research and development, know-how, customers,\ntrade secrets, financial methods, computer programs, and other confidential or proprietary information or trade secrets of the\nCompany, its Associated Companies, Business Partners, Distributors, Resellers, Customers and End-Users.\nAn Employee agrees to take all appropriate action, whether by instruction, agreement or otherwise, to ensure the protection,\nconfidentiality and security of the Confidential Information of the Company.",
        "evidence": {
          "value": 675,
          "confidence": 0.7,
          "source_text": "CONFIDENTIALITY AGREEMENT\nIn consideration of an Employee’s employment with The Company, employees will be exposed to informat",
          "page_number": 6,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 361
}