{
  "contract_id": "96a68ce2cd9595a5",
  "filename": "Offer-Letters_compressed.pdf",
  "file_hash": "96a68ce2cd9595a5f36d10c03f29fde6bb98ab822408eef406675b2fae22cf69",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": 320000.0,
      "confidence": 0.9,
      "source_text": "3.2LPA",
      "page_number": 54,
      "method": "regex"
    },
    "notice_period_days": {
      "value": 30,
      "confidence": 0.9,
      "source_text": "30 Days notice",
      "page_number": 56,
      "method": "regex"
    },
    "bond_amount_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "non_compete_months": {
      "value": 6,
      "confidence": 0.9,
      "source_text": "Non-Compete: You agree and confirm that during your employment with Vision Beyond Resources\nIndia Pvt. Ltd., you will not directly or indirectly expropriate any corporate opportunities or otherwise\nengage in any conduct adverse to the best interests of the Company and its relationships with its\nCustomers. Further, during your employment and for a period of one (1) year following the\ntermination of your employment for whatever reason, you will not, directly or indirectly, solicit the\nbusiness of or offer to provide consulting or contract services, to, any Customer of the Company\n(including the Customer’s customer) regardless of whether or not you personally dealt with the party\nduring your employment.\n6. Non-Solicitation: During your employment, and for a one (1) year period following termination of\nyour employment for whatever reason, you will not, directly or indirectly, solicit the services of (or\notherwise deal in a manner adverse to the Company) any employee of the Company or induce such\nemployees to terminate his or her employment. If, during your employment, you are approached or\ncontacted by any employee or former employee of the Company suggesting, proposing, recruiting or\ninducing you to terminate your employment with the Company, you agree to notify the Company\nimmediately in writing.\n7. In addition to your fixed and variable compensation you would be eligible for benefit of Health\nInsurance coverage of 5 Lac (Floating Medical Insurance Coverage) & 10 Lacs of Life Insurance\nCoverage.\n8. You will be entitled to leave, holidays, benefits, and other allowances as applicable & in\naccordance with the rules of the Company.\n9. This is only a conditional job offer letter which is subject to successful employment & educational\nverification from your previous employers & university/Institute. Vision Beyond reserves the right to\nrevoke the offer at any time.\n10. You will be subject to the Company's rules & regulations, as may be applicable.\n\nDetailed Appointment letter will be issued to you at the time of Joining. Following documents are\nrequired for the completion of joining formalities.\na) Your Previous offer, appointment, Relieving, Work Experience Certificates\nb) Educational Certificates\nc) Aadhar & PAN copy\nd) Cancel cheque of active bank account (Name should be printed on the cheque)\ne) 1 passport size photographs\nWe look forward to your active participation with the Company's business growth and mutually\nbeneficial association with you.\nPlease confirm that this letter sets forth the terms of your employment with the Company by\ncountersigning a copy of this letter below. Your signature below indicates that you fully understand\nthe terms of your employment with the Company and that you enter this Agreement knowingly and\nof your own accord.\nWe welcome you to VBeyond Family!\nYours faithfully,\nBaleshwar Pandey\nAVP-Human Resources\nVision Beyond Resources India Pvt. Ltd.\n======================================================================\nTo accept these offers of employment please return a signed and dated copy of this letter to me.\nI…………………………………….. have read and understood this letter and accept the offer of\nemployment from Vbeyond Digital on the terms and conditions set out in the letter.\nSigned by ……… Date:\n\nAnnexure-I\nSalary breakup (in Indian Rupees):-\nPay Head Monthly Annual\nA) Base Compensation:\nBasic 6000 72000\nH.R.A. 3000 36000\nSpecial All. 4714 56568\nNight Shift All 5000 60000\nGross Salary 18714 224568\nB) Other Benefits:\nEmployer's PF Contribution 1286 15432\nTotal (A+B) 20000 240000\nC) Annual Performance Variable*\n150000\nD) Insurance Benefits:\nHealth Insurance 3300\nTerm Insurance 2200\nE) Retirement Benefits\nGratuity (If Applicable) 3456\nTotal CTC (A+B+C+D+E) 398956\nNote:\n▪ Gratuity is payable as per Payment of Gratuity Act.\n▪ Any Tax implication arising out of the above structure to be borne by the employee.\n▪ Income Tax relief in respect of Reimbursements will be provided only on Production of bills and\nwill be restricted to the amount mentioned against them.\n*This is a performance based variable and is paid as per the company’s policy\n\n3/6/23, 11:06 AM Kanpur Institute of Technology Mail - Re: Welcome to Nucleus Software - Ankish Gupta\nShefali Tiwari <ankita.saxena@kit.ac.in>\nRe: Welcome to Nucleus Software - Ankish Gupta\n1 message\nANKISH GUPTA CSA 029 <1816510029@kit.ac.in> 8 December 2021 at 18:21\nTo: SAPNA.PANDEY@nucleussoftware.com\nCc: Nidhi G Kapoor <dean.tnp@kit.ac.in>, Ankita Saxena <manager2.tnp@kit.ac.in>\nThank you for your mail.\nI accept the offer.\nRegards,\nAnkish Gupta\nOn Tue, 7 Dec 2021, 11:50 am , <SAPNA.PANDEY@nucleussoftware.com> wrote:\nDear Ankish Gupta,\nIt gives us immense pleasure, to have you as a part of Nucleus Family. As you step in we hope for a long lasting\nand enduring relationship that grows year after another.\nOn the date of joining, you are requested to submit two photocopies each, of the following documents:\n1) All Educational Certificates & Mark sheets (starting from 10th).\n2) Offer/Appointment Letter, Resignation/Relieving Letter & Latest Salary Slip of Current Organization\n3) All Previous Appointment,Relieving/Experience Letters & Salary Slips of respective organisations\n4) Passport.\n5) Eight Passport size photographs with white background.\n6) Medical Fitness Certificate from a Registered Medical Practitioner.\n7) PAN Card Copy\n8) Aadhar Card\n9) UAN (Universal account number) for PF (provident fund) from previous organisation\nWarm Regards,\nSAPNA PANDEY\nNucleus Software Exports Ltd.\nA-39, Sector - 62,\nNoida. Phone: 0120-4031400\nhttps://mail.google.com/mail/u/1/?ik=770429467f&view=pt&search=all&permthid=thread-f%3A1718582388221631512%7Cmsg-f%3A171858238… 1/1\n\nTIAA Global Business Services (India) Private Limited\nRegistered office: OFF NO 10th\nFloor, North and South\nTower, Godrej One Godrej Soap\nIndustrial Area, Vikhroli East Mumbai\nMumbai City MH 400079 IN\nCIN: U72901MH2016FTC279876\nPhone: +91 226 229 8000\nEmail: tiaagbs_info@in.tiaa.org\nJune 27, 2022\nAnkit Singh\nHouse no 300 LIG Colony, Rampuram Shyamnagar\nKanpur Nagar,\nKANPUR- 208013, Uttar Pradesh India\nDear Ankit:\nIt is with great pleasure that we extend you a Contingent offer of employment, based\nprovisionally upon your eligibility, qualification and Back Ground Verification parameters being\nmet in a timely manner, at TIAA Global Business Services (India) Private Limited (“GBS”) or\n(“the Company”), which is a subsidiary of Teachers Insurance and Annuity Association of\nAmerica (“TIAA”) incorporated in India. This offer is subject to the following terms and\nconditions:\n1. Position and Probation\nYou will assume the responsibility of Trainee, Testing Analyst with a start date on or before July\n25, 2022 as discussed with your Human Resource representative.\n\nYou are assigned to work out of our Pune, India Location.\nYour employment will be contingent upon the successful completion of a Three Hundred and\nSixty five (365) days initial probationary period, which period shall commence from the date of\nyour joining the Company. Notwithstanding anything stated in section 6.1 herein, during the\nprobationary period your employment can be terminated by either you or GBS giving to the\nother thirty (30) days of notice in writing. If your performance is satisfactory to the Company\nduring this probationary period, then notice of termination by either party shall be extended\nafter the probationary period to the period of time specified in Section 6.1. The Company may\nalso choose to extend such probationary period, in accordance with law.\nThe normal hours of work at GBS are forty-five (45) per week, Monday through Friday, and will\nbe established for you by your manager. Subject to applicable laws, however, actual working\nhours, their timing and weekly holidays may vary with the duties and requirements of your\nposition consistent with a 24 x 7 multi-shift work environment and other business needs as\nGBS may specify.\n2. Duties and Responsibilities / Transfer\nThe duties and responsibilities required for the position offered to you are set forth in the job\ndescription provided to you before and/or during your interview with GBS. You may be\nrequired to perform other duties as required by the Company from time to time. You shall not\nrefuse to perform other duties and undertake responsibilities as and when called upon by your\nreporting manager, if any.\nThe Company has a right to assign, transfer, second or depute you to any affiliates,\ndepartments, subsidiaries or associate companies of the Company or to any group companies\nin which the Company may be having interest whether existing or which may be set up or\nestablished or acquired in future in any other location in India or to any third parties. The\nCompany does not guarantee the continuation of any benefits or perquisite at the new location.\nIn all such cases of transfer you will be governed by the relocation policies and policies of the\nCompany existing at that time.\nYou shall devote all of your skill, knowledge and working time to the conscientious\nperformance of your duties and responsibilities and you shall perform your duties with diligence\nand devotion. Since this is a full-time employment with the Company, while in the employment\nof the Company, you are not allowed to be employed in any other organization on a\npermanent, temporary or part time basis nor shall you offer your services with or without\n\nconsideration to any physical person, legal entity or public authority or be occupied in your own\nbusiness, without the prior written consent of the Company. You will comply with all directions\ngiven to you by the Company and faithfully observe all the rules, regulations, and\narrangements applicable to you.\nYour provisional employment will, in addition to the terms and conditions of this offer of\nemployment specifically stated herein, also be governed by the rules, regulations and such\nother practices, systems, procedures and policies framed, amended, modified or omitted by the\nCompany from time to time, including those as may be provided in the Company’s policies\nservice rules, code of conduct, etc. The contingent nature of this offer of employment, shall be\ndischarged and be set for regularization of your employment, when:\nYou pass all subjects required to be cleared in order for you to graduate your course\nYou have been given an all cleared Degree by your institution\nYour Back ground verification is concluded successfully, by TIAA India or it’s assigned third\nparty\nAll the above activities are concluded within 6 months",
      "page_number": 57,
      "method": "regex"
    },
    "probation_months": {
      "value": 6,
      "confidence": 0.9,
      "source_text": "Probation\n\n1.1 You will assume the responsibility of Trainee, ​Testing Analyst​ with a start date on or before ​\nJuly 25, 2022​ as discussed with your Human Resource representative.\n1.2 You are assigned to work out of our Pune, India Location.\n1.3 Your employment will be contingent upon the successful completion of a Three Hundred\nand Sixty five (365) days initial probationary period, which period shall commence from the\ndate of your joining the Company. Notwithstanding anything stated in section 6.1 herein, during\nthe probationary period your employment can be terminated by either you or GBS giving to the\nother thirty (30) days of notice in writing. If your performance is satisfactory to the Company\nduring this probationary period, then notice of termination by either party shall be extended\nafter the probationary period to the period of time specified in Section 6.1. The Company may\nalso choose to extend such probationary period, in accordance with law.\n1.4 The normal hours of work at GBS are forty-five (45) per week, Monday through Friday, and\nwill be established for you by your manager. Subject to applicable laws, however, actual\nworking hours, their timing and weekly holidays may vary with the duties and requirements of\nyour position consistent with a 24 x 7 multi-shift work environment and other business needs\nas GBS may specify.\n2. Duties and Responsibilities / Transfer\n2.1 The duties and responsibilities required for the position offered to you are set forth in the\njob description provided to you before and/or during your interview with GBS. You may be\nrequired to perform other duties as required by the Company from time to time. You shall not\nrefuse to perform other duties and undertake responsibilities as and when called upon by your\nreporting manager, if any.\n2.2 The Company has a right to assign, transfer, second or depute you to any affiliates,\ndepartments, subsidiaries or associate companies of the Company or to any group companies\nin which the Company may be having interest whether existing or which may be set up or\nestablished or acquired in future in any other location in India or to any third parties. The\nCompany does not guarantee the continuation of any benefits or perquisite at the new location.\nIn all such cases of transfer you will be governed by the relocation policies and policies of the\nCompany existing at that time.\n2.3 You shall devote all of your skill, knowledge and working time to the conscientious\n\nperformance of your duties and responsibilities and you shall perform your duties with diligence\nand devotion. Since this is a full-time employment with the Company, while in the employment\nof the Company, you are not allowed to be employed in any other organization on a\npermanent, temporary or part time basis nor shall you offer your services with or without\nconsideration to any physical person, legal entity or public authority or be occupied in your own\nbusiness, without the prior written consent of the Company. You will comply with all directions\ngiven to you by the Company and faithfully observe all the rules, regulations, and\narrangements applicable to you.\n2.4 Your provisional employment will, in addition to the terms and conditions of this offer of\nemployment specifically stated herein, also be governed by the rules, regulations and such\nother practices, systems, procedures and policies framed, amended, modified or omitted by the\nCompany from time to time, including those as may be provided in the Company’s policies\nservice rules, code of conduct, etc. The contingent nature of this offer of employment, shall be\ndischarged and be set for regularization of your employment, when:\n2.4.1 You pass all subjects required to be cleared in order for you to graduate your course\n2.4.2 You have been given an all cleared Degree by your institution\n2.4.3. Your Back ground verification is concluded successfully, by TIAA India or it’s assigned\nthird party\n2.4.4. All the above activities are concluded within 6 months",
      "page_number": null,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "6.1 Except as provided in Section 1 and Section 2.4.1, your provisional employment may be\nterminated at any time by either you or GBS giving to the other thirty (30) days of notice in\nwriting. The Company may in its sole discretion decide to pay you in lieu of notice.",
        "evidence": {
          "value": 268,
          "confidence": 0.7,
          "source_text": "Termination\n6.1 Except as provided in Section 1 and Section 2.4.1, your provisional employment may be\nterminated",
          "page_number": 19,
          "method": "regex"
        }
      },
      "ip": {
        "text": "Company will not be utilized by you at any point of time to undermine the interests of\nE-Ashwa Automotive Pvt Ltd and Group Companies.\n• During the period of your employment, any inventions, creations, discoveries,\npatents, copyrights etc., shall become the property of the E-Ashwa Automotive Pvt\nLtd.\n• As an employee, you will be privy to sensitive and commercially valuable information\nconcerning the E-Ashwa Automotive Pvt Ltd and its business. Such information is\ndeemed to be the property of the E-Ashwa Automotive Pvt Ltd, and must not be",
        "evidence": {
          "value": 545,
          "confidence": 0.7,
          "source_text": "intellectual property and documents obtained during your association with the\nCompany will not be utilized by you at any point of time to undermine the interests of\nE-Ashwa Autom",
          "page_number": 50,
          "method": "regex"
        }
      },
      "non_compete": {
        "text": "You agree and confirm that during your employment with Vision Beyond Resources\nIndia Pvt. Ltd., you will not directly or indirectly expropriate any corporate opportunities or otherwise",
        "evidence": {
          "value": 184,
          "confidence": 0.7,
          "source_text": "Non-Compete\nYou agree and confirm that during your employment with Vision Beyond Resources\nIndia Pvt. Ltd., you ",
          "page_number": null,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "performing the official duties. The policy requires Covered Persons to complete the mandatory\ntraining and mandates the obtaining of pre- clearance approval of their trades before booking a\ntrade in any stock exchange outside India.",
        "evidence": {
          "value": 232,
          "confidence": 0.7,
          "source_text": "confidentiality of all such information which he/she obtained directly/indirectly in the course of\nperforming the official duties. The policy requires Covered Persons to complete the mandatory\ntraini",
          "page_number": 19,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 2269
}