{
  "contract_id": "a4b9ab5cff29d2b1",
  "filename": "Employment_Contracts_in_India.pdf",
  "file_hash": "a4b9ab5cff29d2b1289c1835399dc63d60b7098aaab17922ffb76f8611780d40",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "notice_period_days": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "bond_amount_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "non_compete_months": {
      "value": 204,
      "confidence": 0.9,
      "source_text": "non-compete etc.) with an erstwhile employer\nThe emergence of this new class has made\nwhich he or she might have breached. Typically,\nthe system more complex. In the past, the\nsuch disputes would arise between the erstwhile\nmajority of the disputes arose between the\nemployer and employee. However, there have\nworkers/ labourers or the unions comprising\nbeen instances where the prospective employer\nthe working class and the employers, which\nhas also been dragged into litigation, by taking the\nwere sought to be addressed through various\nposition that the new employer is encouraging\nenacted laws to protect the interests of the\nand assisting the employee to breach his\nweak. These laws also envisioned resolution\nobligations towards the previous employer.\nof disputes between the trade unions and\nthe management for their rights, which Further, many companies have a pre-\nwere perpetrated either through strikes, employment screening policy, with an objective\nbandhs or hartals. of gaining a degree of certainty that the\npotential employee does not have a criminal\nHowever, as the complexities in the work\nrecord involving dishonesty, or breach of trust\nfield increased, the ‘white collar’ workers\ninvolving his/her fiduciary or official capacity,\noften found themselves engaged in various\nor has not misused his/her official or fiduciary\nmatters related to breach of fiduciary\nposition to engage in a wrongful act including\nresponsibilities, corporate defamation, and\nmoney laundering, fraud, corruption etc. Such\ncorporate law non-compliance. They are also\na screening policy may raise concerns of\nengaged in issues regarding payment terms,\nviolation of the right to privacy of the persons\ntermination of service, breach of confidentiality,\nbeing subjected to such screening, as the mode\nnon-compete or non-solicitation clauses adding\nand manner of gathering such information\na new domain to the concept of industrial\nmay violate rights of individuals guaranteed\nrelations. The legal framework addressing the\n1\nunder Article 21 of the Indian Constitution.\nlatter is still at a nascent stage in India. This Part\ndiscusses the situations where such disputes\nmay arise between employers and employees at 1. Vikram Shroff & Neha Sinha, Background Checks in India,\nSociety for Human Resource Management (2012) available at\nvarious stages of their relationship.\nhttp:// www.shrmindia.org/knowledge-center/talent-acquisition/\nbackground-investigations/background-checks-india.\n2 © Nishith Desai Associates 2019\n\nEmployment Contracts in India\nEnforceability of Restrictive Covenants\nThe Nine Judge Bench of the Supreme Court in conduct etc., are few of the contentious issues\nJustice K.S Puttaswamy (Retd.) v. Union of India which may ultimately lead to a dispute.\n2\nand Ors. recently held that the right to privacy\nis protected as an intrinsic part of the right to\nB. Disputes Relating to Restrictive\nlife and personal liberty under Article 21 and\nCovenants effective During\nas a part of the freedoms guaranteed by Part III\nEmployment\nof the Constitution. The judgment has defined\nnine different kinds of privacy and one of them\nThere are broadly two kinds of restrictive\n3\nincludes Informational Privacy.\ncovenants in operation during the term of\nThe following scenario may also give rise to employment which are non-compete and\npre-hire employment disputes:- non- disclosure of confidential information.\na. When the employer withdraws If the employee is in breach of a non-compete\nemployment offer prior to the restriction, prohibiting him/her from engaging\nemployee’s joining. in any kind of business or activity which is\nsimilar to the company’s business, or making\nb. When the employee’s background check\na mandate to not disclose or misuse confidential\nresults are unsatisfactory or the employee\ninformation or trade secret passed on to\nprovides disclosures or misrepresents to\nthe employee, during the course of his/her\nthe prospective employer.\nemployment then such breaches would\nBut to reduce litigation risk, it is also helpful to inevitably lead to a potential dispute.\nobtain a representation from the new employee\n(whether under the employment contract or III. Termination\notherwise) that the employee has not and will\nnot breach any obligations towards his previous\nIn cases where the employee voluntarily\nemployer, as a result of joining the employment\nresigns or retires from employment,\nunder the new employer. This has been adopted\nit is unlikely to happen that there will occur\nas a standard practice in most multi-national\na dispute (unless there are elements of\ncorporations these days to avoid litigation at\na breach being committed by the employee).\na later stage.\nIn contrast, termination of employment by the\nII. During Employment employer often leads to a stand-off between\nan employee and employer which has all the\ningredients for baking a potential dispute.\nDuring the course of employment, several\nTermination of employment due to misconduct,\ndisputes may arise between the employer\nbreach of the employment agreement including\nand the employee. These can be broadly\nviolation of restrictive covenants therein,\nsummed up in 2 categories:\nis often escalated and settled through resort\nto courts.\nA. Employment Related Disputes\nAn important factor to be considered in\nMisconduct or indiscipline of an employee, a dispute relating to termination of employment\ninsider trading, indulging in criminal activities, by the employer is whether the employee being\nunder-performance, breach of the terms of the so terminated enjoys statutory protection of\nemployment contract or HR policies/code of employment such as a “workman” as defined in\nthe Industrial Disputes Act, 1947 (“IDA”) and/or\nprotection under the state-specific labour laws\nsuch as the Shops and Establishments Act. The\n2. WP (C) 494 of 2012.\nIDA also contains provisions for unfair labour\n3. An interest in preventing information about the self from\nbeing dissemination, and controlling the extent of access to practices on the part of the employer.\nthe information.\n© Nishith Desai Associates 2019 3\n\nProvided upon request only\nIf the employee does enjoy such protection, protecting the interests of the employer\nthen before terminating the employment of seeking to protect itself from competition.\nsuch an employee for any of the above reasons, In view of the Constitution of India and the\nthe employer would have to serve the employee provisions of the Indian Contract Act, 1872,\nwith at least a 30 days’ notice or pay salary in (“Contract Act”) courts have generally held that\nlieu thereof. the right to livelihood of the employees must\nprevail over the interest of the employer, in spite\nThe procedure to be followed for termination\nof an existing agreement between the employer\ndue to ‘misconduct’ would involve framing of\nand the employee.\ncharges, issuance of a charge sheet, conducting\nan internal (domestic) enquiry by an unbiased Further, courts frown upon any form of\ninquiry officer, followed by issuance of post-employment restraint, as such restraints\na show cause notice. The process needs to be are considered to limit the economic mobility\nin accordance with the principles of natural of the employees, thereby limiting their\njustice and the employee should be given an personal freedom of choice of work/livelihood.\nopportunity to submit his/her defence and The underlying reason behind invalidating\nto call upon witnesses. Decision to terminate post-employment restraints is that if such\nemployment of an employee should be taken restraints are permitted, the employee would\ndepending upon the gravity of the misconduct be unfairly restrained from using the skills\ndone on the part of the employee. and knowledge gained, to advance further\nin the industry precisely because of such\n4\nIV. Post- Termination increased expertise.\n5\nIn Affle Holdings Pte Limited vs. Saurabh Singh ,\nThe covenants restraining employees from the Delhi High Court held that a negative\njoining competitors after the cessation of covenant in the employment contract, which\nemployment are often found in modern day prohibits carrying on a competing business beyond\nemployment contracts. Restrictions in this the tenure of the contract is void and not enforceable.\ncategory may also prevent a former employee This prohibition operates on account of the\nfrom starting a competing business or advising provisions of Section 27 of the Contract Act.\na family member or relative who is in a similar\nThe validity of such restrictive covenants\nline of business.\nare tested on the standards of reasonability,\nA breach of post termination clauses often involving considerations of duration and space\nforces the employer to seek advice on the of the restriction in question. The following part\nlegal recourse available to it. Indian courts discusses the scope and interpretation of such\nhowever prioritize the protection of rights restrictive covenants within the Indian legal\nof an employee seeking employment over framework.\n4. Journal of Intellectual Property Rights Vol.11, Nov 2006, pp,\n397-408: http://www.rmarkhalligan2.com/trade/articles.\nasp?id=next&currentId=2 (18 April 2006).\n5. OMP 1257/2014.\n4 © Nishith Desai Associates 2016\n\nEmployment Contracts in India\nEnforceability of Restrictive Covenants\n3. The Status of Restrictive Covenants in India\nIncorporation and subsequent enforcement and fairness are aptly applied, depending upon\nof ‘restrictive covenants’ such as confidentiality, the facts and circumstances of each case.\nnon-disclosure and non-solicitation in\nEmployers often tend to incorporate restrictive\nemployment contracts, intended to restrict the\ncovenants in the agreement to protect their\nemployees from disseminating confidential\nconfidential information and trade secrets and\nand other important information exclusively\nas well as their growing businesses as well. But\navailable with an employer, are often amongst\nfor any restrictive covenant to fall within the\ncontentious issues in India because such\nambit of Section 27 of the Contract Act,\nprovisions seemingly conflict with Section\nthe agreement should be in restraint of trade.\n6\n27 of the Contract Act.\nUnlike the law in the United Kingdom, the\nContract Act does not distinguish between\nI. Non-Competition\npartial and total restraint of trade and therefore\nRestriction if the clause in the agreement amounts to post\ntermination restraint, then the same is void.\nSection 27 itself is succinct and doesn’t offer\nAn agreement in restraint of trade has been\ninsight as to what kinds of restraints are valid,\ndefined as “one in which a party agrees with\nso the qualification of ‘reasonable’ restraints\nany other party to restrict his liberty in the future\nbeing valid and enforceable has been read into\nto carry on trade with other persons who are not\n8\nSection 27 by the courts.\nparties to the contract in such a manner as he\n7\nchooses”. As an exception to this general rule, To determine whether a restrictive covenant\nagreements under which one party sells his/ in employment contract would be reasonable/\nher goodwill to another, while agreeing not to valid or not, the courts have paid due regard to\ncarry on a similar business within specified local bargaining power of each party, reasonableness\nlimits, are valid, provided such an agreement of restrictions set out in the covenant, time,\nappears to be reasonable to the Court. place and manner of restriction etc.\nArticle 19 (g) of the Constitution of India clearly In India, due to the heavy bargaining power\nprovides every citizen, the right to practice of the employers, the trend is for the courts to\nany profession, trade or business. This is not protect the rights of the employees and adopt\nan absolute right, and reasonable restrictions an interpretation favourable to them. Section\ncan be placed on this right in the interest of 27 of the Contract Act applies in the context of\nthe public. The courts have always been weary (1) employer - employee contracts, (2) contracts\nof upholding such restrictions and have kept with partners, (3) dealer contracts and (4)\nthe interpretation of this provision flexible to miscellaneous cases.\nensure that the principles of justice, morality\n6. Section 27 of the Contract Act provides that ‘every agreement\nby which anyone is restrained from exercising a lawful\nprofession, trade or busi- ness of any kind, is to that extent\nvoid.’\nException 1: Saving of agreement not to carry on business of\nwhich good will is sold - One who sells the goodwill of\na business may agree with the buyer to refrain from carrying\non a similar business, within specified local limits, so long as\nthe buyer, or any person deriving title to the goodwill from\nhim, carries on a like business therein, provided that such\nlimits appear to the court reasonable, regard being had to the\nnature of the business.\n8. Niranjan Shankar Golikari v. The Century Spinning & Mfg.\n7. Petrofina (Great Britain) Ltd. v. Martin, (1966) Ch. 146. Co. Ltd. (1967) 2 SCR 378.\n© Nishith Desai Associates 2019 5\n\nProvided upon request only\nWhile it is a settled position of law that his/her former employer’s trade secrets. Subject\nrestrictive agreements bind current employees to this exception, the employee is entitled\nin lawful employment of the employers to exploit the full range of the knowledge and\nthroughout the duration of the contract, the skill possessed by him/her. The Supreme Court\nposition of laws regarding validity of such relied on Lord Halsbury’s Laws of England\nrestraints on employees after termination of which stated that as a general principle an\ncontract is more contentious and adjudicated individual was entitled to exercise his/her\nbefore courts. lawful trade or calling as and when he wills\nand that the law had jealously guarded against\nThe Supreme Court of India (“Supreme Court”)\ninterference with trade even at the risk of\nin Niranjan Shankar Golikari v. Century Spg &\ninterference with freedom of contract,\n9\nMfg Co. Ltd enumerated the tests to determine\nas it was public policy to oppose all restraints\nthe validity of ‘restrictive’ agreements in terms\nupon liberty of individual action which are\nof Section 27 of the Contract Act. In this case,\ninjurious to interests of trade. This principle\na foreign producer collaborated with a company\nwas based on public policy, which is a dynamic\nmanufacturing tyre cord yarn by an agreement\nconcept that changes and evolves depending\nwhich stated that the company would\nupon time and needs.\nmaintain secrecy of all technical information.\nIn pursuance of the agreement, the company Referring to the above-mentioned Supreme Court\nsigned a non-disclosure agreement with the case, Delhi High Court in LE Passage to India\n10\nappellant, at the time of his/her employment. Tours & Travels Pvt. Ltd vs. Deepak Bhatnagar\nobserved that under Indian law there is a\nThe Supreme Court observed as thus:\ncomplete embargo to an agreement in restraint\n“…considerations against restrictive covenants of the trade with the sole exception that one who\nare different in cases where the restriction sells goodwill of a business may agree with the\nis to apply during the period after the termination buyer to refrain from carrying a similar business\nof the contract than those in cases where “within specified local limits” provided that such\nit is to operate during the period of the contract. limits appear to the Court to be reasonable, regard\nNegative covenants operative during the period being had to the nature of the business. However,\nof the contract of employment when the employee in the garb of the alleged sale of goodwill of the\nis bound to serve his employer exclusively are trade, parties cannot enforce a restraint on the\ngenerally not regarded as a restraint of trade and employment even after the employee ceases\ntherefore do not fall under section 27 of the Contract to be in the employment.\nAct. A negative covenant that the employee would\nRecently, in the case of Kumar Apurva v.\nnot engage himself in a trade or business or would\n11\nValuefirst Digital Media Pvt. Ltd., the court\nnot get himself employed by any other master for\nupholding the decision of the Arbitral Tribunal,\nwhom he would perform similar or substantially\nrestrained the appellant from carrying any\nsimilar duties is not therefore a restraint of trade\nactivity which is competitive to that of\nunless the contract as aforesaid is unconscionable or\ncompany, and also from soliciting, interfering\nexcessively harsh or unreasonable or one sided…”\nwith, disturbing or attempting to disturb the\nIn light of the above observations, the relationship between the company or subsidiary\nagreement was held to be valid and the and third party, including any customer or\nappellant was accordingly restrained from supplier of the company or subsidiary.\nserving anywhere else for the duration of the\nIn Percept D’Mark (India) Pvt. Ltd. v. Zaheer\nagreement. The Supreme Court held that there\n12\nKhan & Anr. it was held by the Supreme Court\nis an implied term in a contract of employment\nthat a former employee may not make use of\n10. IA Nos. 15636, 16817 & 16770/2013 in CS (OS) 1881/2013.\n11. 2015 SCC Online Del 8360.\n9. id. 12. AIR 2006 SC 3426.\n6 © Nishith Desai Associates 2019\n\nEmployment Contracts in India\nEnforceability of Restrictive Covenants\nthat “… a restrictive covenant extending beyond against the manager prohibiting him/her from\nthe term of the contract is void and not enforceable”. soliciting Desiccant’s customers and suppliers\nThe Supreme Court also held that “the doctrine to stand in effect. It is pertinent to note, however,\nof restraint of trade does not apply during the that the Delhi High Court held that a marketing\ncontinuance of the contract of employment and it manager could not be deemed to possess\napplies only when the contract comes to end.” The confidential information and that his written\nSupreme Court further went on to observe declaration to that effect in his employment\nthat the doctrine of restraint of trade “is not agreement was also meaningless and thus the\nconfined to contracts of employment, but is Court rejected Desiccant’s claim to enforce the\nalso applicable to all other contracts”. confidentiality obligations on the manager.\nFurther in the case of Ozone Spa Pvt. Ltd. v. Pure Further, in FL Smidth Pvt. Ltd. v M/s. Secan\n13 15\nFitness & Ors. , the court restricted the defendants Invescast (India) Pvt.Ltd. (“Secan Invescast”)\nfrom establishing, running or setting up any the Madras High Court held that merely\ncompeting business in any area that falls within approaching customers of a previous employer\na range of 4 kilometers from the premises of the does not amount to solicitation until orders\nplaintiff. Although, Section 27 states that all have been placed by such customers based on\nagreements in restraint of any profession, are void, such approach. The Madras High Court laid\nso long as an employee does not have the motive down the standard to establish non-solicitation:\nto cheat, mistrust or cause irreparable loss to the\n“….solicitation is essentially a question of fact.\ncompany, trade or business. Hence, reasonable\nThe appellants should prove that the respondents\nrestraints are permitted and they do not render\napproached their erstwhile customers and only\nthe contract void.\non account of such solicitation, customers placed\nThe next part of the paper discusses the orders with the respondents. Mere production of\napplicability of non-solicitation, non-disclosure quotation would not serve the purpose. It is not\nand confidentiality clauses at length. that the appellant is left without any remedy. In\ncase the Court ultimately holds that the appellant\nII. Non-Solicitation of has got a case on merits, they can be compensated\nby awarding damages. The supplies made by\nEmployees and Customers\nthe respondent to the erstwhile customers of the\nappellant would be borne out by records. There\nA non-solicitation clause prevents an employee would be no difficulty to the appellant to prove\nor a former employee from indulging in that in spite of entering into a non-disclosure\nbusiness with the company’s employees or agreement, respondent has solicited customers\ncustomers against the interest of the company. and pursuant to such solicitation they have\nFor example, an employee agrees not to solicit actually supplied castings. When there is such\nthe employees or clients of the company for an alternative remedy, question of issuing\nhis/her own benefit during or after his/her a prohibitory injunction does not arise.”\nemployment.\nThe Secan Invescast judgment states that such\nNon-solicitation obligations have been enforced clauses may be valid if reasonable restrictions\nin some circumstances, albeit on a case such as distance, time limit (reasonable time\nto case basis. For instance, in Desiccant Rotors frame), protection and non-usage of trade secrets\n14\nInternational Pvt. Ltd v Bappaditya Sarkar & Anr. , and goodwill are imposed on former employees.\nthe Delhi High Court allowed an injunction The increasing significance of protecting client\ninformation is brought out in Embee Software Pvt.\n13. 2015 SCC Online Del 10768 : 2015 222 DLT 372.\n14. Desiccant Rotors International Pvt Ltd v Bappaditya Sarkar\n& Anr., Delhi HC, CS (OS) No. 337/2008 (decided on July 14, 15. M/s.FLSmidth Pvt.Ltd. v M/s.Secan Invescast (India) Pvt.Ltd.,\n2009). (2013) 1 CTC 886.\n© Nishith Desai Associates 2019 7\n\nProvided upon request only\n16\nLtd. v. Samir Kumar Shaw, wherein the Calcutta attracted and thus the agreement was held not\nHigh Court held that ‘acts of soliciting committed to be in restraint of trade. In Wipro, the Delhi\nby former employees take such active form that it High Court highlighted the following salient\ninduces the customers of the former employer to break aspects in this context:\ntheir contract with the former employer and enter into\ni. Negative covenants tied up with\na contract with the former employee, or prevent other\npositive covenants during the subsistence\npersons from entering into contracts with the former\nof a contract be it of employment,\nemployer cannot be permitted’.\npartnership, commerce, agency or the like,\nThis decision echoes in the decision would not normally be regarded as being\n17\nof Crowson Fabrics Ltd. v. Rider, where in restraint of trade, business of profession\nit was held that even though the act of unless the same are unconscionable or\nretaining various documents belonging to wholly one- sided;\nthe ex-employer concerning customer and\nii. Negative covenants between employer\nsupplier contact details by the employees\nand employee contracts pertaining to the\nduring employment did not amount to a breach\nperiod post termination and restricting the\nof confidentiality, such ‘illegitimate’ actions\nemployee’s right to seek employment,\nconstituted a breach of employees’ duty of\nand/ or to do business in the same field as\nfidelity. Recently the Delhi High Court, setting\nthe employer, would be in restraint of trade\naside the decision of lower Court, held that\nand, therefore, a stipulation to this effect in\nan agreement in restraint of carrying of any\nthe contract would be void. In other words,\n18\nprofessional activity is contrary to law.\nno employee can be confronted with the\nHowever there are certain non-solicitation situation where he has to either work for the\nclauses that do not amount to restraint of trade, present employer or be forced to idleness;\nbusiness or profession and would not be subject\niii. While construing a restrictive or negative\nto Section 27 of the Contract Act, as held by\ncovenant and for determining whether\nthe Delhi High Court in Wipro Ltd. v. Beckman\nsuch covenant is in restraint of trade,\n19\nCoulter International SA (“Wipro”). In this\nbusiness or profession or not, the courts\ncase, Wipro worked as a sole and exclusive\ntake a stricter view in employer-employee\ncanvassing representative/ distributor for\ncontracts than in other contracts, such\nBeckman Coulter International, S.A., for 17 years",
      "page_number": 8,
      "method": "regex"
    },
    "probation_months": {
      "value": 14,
      "confidence": 0.9,
      "source_text": "probationary period, the employee\nThe employer in order to protect and safeguard will be required to reimburse the bond amount\nits interest often executes a training bond with of Rs. 2,00,000 to the employer for the notional\nits employees for training imparted and/or training expenses and any other expenses\nprovided during the course of their employment that the employer had incurred on behalf of\nor specifically provided prior to their joining, to the employee. The Delhi High Court observed\nensure that they work for a particular duration. that there was no occasion for the employee to\nThese bonds specify the minimum period for undergo training or the employer to incur any\nwhich the employee shall serve the employer, expenses on training The court observed that\nthough such clauses may not be enforceable expenses incurred by the employer towards\nin the Indian context. If the employee acts in carrying out the process of appointment\nbreach of such an agreement, the employer including advertisement, or the expenses\ncan seek compensation, at times which are incurred expenses in future for making an\nlimited to the expenses incurred for training appointment against the vacancy arisen because\nthe employees. However, the compensation of the employee’s resignation cannot be treated\ndemanded should be reasonable and not as amounts reimbursable by the employee.\nimposed by way of a penalty. The employer is Accordingly, the Delhi High Court held that\nentitled only to reasonable compensation based since there were no training expenses incurred\n36\non facts and circumstances of the case. in the present case, the condition containing the\nemployment bond would not be enforceable\nThe sole purpose of such contracts is to ensure\nagainst the employee at the time of the\nthat the resources and time of employers are\nemployee’s resignation.\nnot rendered meaningless in training with\nno benefits derived whatsoever due to early Similarly, in M/s Sicpa India Limited v. Shri\n39\nresignation. In Satyam Computer Services Manas Pratim Deb, the employee had to enter\n37\nLimited v. Ladella Ravichander, the defendant into two bonds, one which provided that the\nwas an employee who had abruptly left the employee had to work for a period of five years\ncompany and as per terms of employment or pay an amount of Rs. 200,000, and another\nbond, was required to pay liquidated damages which stated that the expenditure on business\nof Rs. 2,00,000 along with stipend charges and trip would be recouped from the services of\nthe employee. The employee resigned from the\ncompany towards the end of five years of his/\n35. Poeton Ltd v Horton, [2001] FSR 169; FSS Travel v Johnson,\n[1999] FSR 505.\n36. 38. 2018IAD(Delhi)444\n37. MANU/AP/0416/2011. 39. MANU/DE/6554/2011.\n12 © Nishith Desai Associates 2019\n\nEmployment Contracts in India\nEnforceability of Restrictive Covenants\nher bond period. The company instructed the industries and niche talent pools, employers\nemployee to pay certain amounts for medical often tend to invest a very large amount of\nexpenses incurred by the company on behalf human capital into their employees. If these\nof the employee. The employee refused to employees subsequently join direct competitors,\npay the amount as it was unreasonable and it can result in substantial economic loss for\nthe matter was taken up to the court where it the ex-employer. A non-poaching agreement\nwas held that the five years mentioned in the therefore enforces guidelines to be followed in\nfirst bond was almost coming towards the end cases of lateral hiring.\nand Rs. 67,596 was already recouped from the\nThis type of agreement essentially considers\nservices of the employee for the second bond.\nthe case wherein two organizations/companies\nTherefore, taking into consideration the period\nagree not to solicit or ‘poach’ the employees\nleft in the bond, the court awarded reasonable\nof their direct competitors. Non-poaching\ndamages to the employer.\nagreement per se does not contravene Section\nIn Toshnial Brothers (Pvt.) Ltd. v. E. Eswarprasad 27 of the Contract Act as it does not restraint\n40\n& Ors. the Madras High Court dealt with an employee from seeking and/or applying\na situation where an employee working as for any job/employment. What this class of\nsales engineer in breach of his undertaking left agreement does instead is, it simply mandates\nhis services within 14 months",
      "page_number": 18,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "being subjected to such screening, as the mode\nnon-compete or non-solicitation clauses adding",
        "evidence": {
          "value": 93,
          "confidence": 0.7,
          "source_text": "termination of service, breach of confidentiality,\nbeing subjected to such screening, as the mode\nnon-compete or non-solicitation clauses adding",
          "page_number": 8,
          "method": "regex"
        }
      },
      "non_compete": {
        "text": "The emergence of this new class has made\nwhich he or she might have breached. Typically,\nthe system more complex. In the past, the",
        "evidence": {
          "value": 130,
          "confidence": 0.7,
          "source_text": "non-compete etc.) with an erstwhile employer\nThe emergence of this new class has made\nwhich he or she might have breached. Typically,\nthe system ",
          "page_number": 8,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "and proprietary information of employers by\nemployees, especially before hiring, during, and This paper seeks to provide an overview of\npost termination of, their employment. the scenarios in which such disputes may\narise between employers and employees,",
        "evidence": {
          "value": 254,
          "confidence": 0.7,
          "source_text": "confidentiality and non-solicitation.\nand proprietary information of employers by\nemployees, especially before hiring, during, and This pa",
          "page_number": 7,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 155
}