{
  "contract_id": "aa1c94ae06b6e8ac",
  "filename": "EMPLOYMENT-AGREEMENT.pdf",
  "file_hash": "aa1c94ae06b6e8ac097e8d4336b6a827f2da516fdc9a79384b3eb33ecc8a2e8b",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": 200000.0,
      "confidence": 0.9,
      "source_text": "2\nlakhs",
      "page_number": 4,
      "method": "regex"
    },
    "notice_period_days": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "bond_amount_inr": {
      "value": 2.0,
      "confidence": 0.9,
      "source_text": "bond of two years the employee is liable to pay penalty equal to Rs. 2",
      "page_number": 4,
      "method": "regex"
    },
    "non_compete_months": {
      "value": 6,
      "confidence": 0.9,
      "source_text": "NON-COMPETE CLAUSE\n7.1 That the employee after the period of employment is over, shall not open similar nature company\nupto three years directly or indirectly. If the company finds that the employee is contravening this\nterm directly or indirectly, then the company shall be entitled to claim damages under section 73,\n74 of the contract act as well as entitled to initiate appropriate legal proceeding against the\nemployee.\n7.2 That the client or the customer shall be sole client of the company. During the employment\nperiod as well as after the employment period is over, if the company finds out that the employee\nis trying to connect with the client of the company directly or indirectly, then the company shall be\nentitled to claim damages under section 73, 74 of the contract act as well as entitled to initiate\nappropriate legal proceeding against the employee.\n7.3 During the course of employment, employee shall not do any personal work or for any third party\notherwise it will become a ground for termination and compensation clause will apply.\n8. TERM OF CONTRACT, TERMINATION OF EMPLOYMENT AND SEVERANCE PAY\n8.1 This Employment Agreement shall continue until terminated by either Party as provided herein\nand supersedes any and all prior oral or written agreements pertaining to the duration,\n\ncompensation and conditions of employment of the Employee.\n8.2 The Employee may lawfully terminate this Employment Agreement by giving to the Employer not\nless than notice in writing and the employee shall not be entitled to get the salary of the notice\nperiod and on break of bond of two years the employee is liable to pay penalty equal to Rs. 2\nlakhs. Employer can terminate the employee any time with immediate effect without giving any\nNotice Period.\n8.3 In case if the employee leaves the company or terminates his/her employment before\ncompletion of two years, then he/she is liable to pay penalty equal to Rs. 2 lakhs. Since the\nEmployer’s company is a software developing company as well as a reputed Training Academy\nthat enjoys tremendous goodwill in the market. Since, a lot of time, energy and effort is devoted\nand invested in grooming young aspiring Employees which is essential in bringing out the best of\ntalent in them and nurturing them to make them able, competent and successful professionals.\n8.4 No severance pay, as mentioned above, will be made to the Employee in case the Company has\nterminated the Employee’s employment due to his/her breach of Agreement or if he/she do not\nmeet the performance criteria prescribed by the Company.\n8.5 All memoranda, notes, records, or other documents made or composed by the Employee, or\nmade available to him/her during the term of this Employment Agreement concerning or in any\nway relating to the business or affairs of the Company, its subsidiaries, divisions, affiliates, or\nclients shall be the Company’s property and shall be delivered to the Company on the\ntermination of this Employment Agreement or at any other time at the request of the Company.\n8.6 That if the employee commits any offence punishable under the Indian Law even outside the\ncompany or with the customer outside the course of employment, the company shall not be\nresponsible for it in any circumstances.\n8.7 That during the course of employment, if the employee commits any fraud with the company and\nas a result of which the company suffers huge loss, in case of such an event, the Employer shall\nbe entitled to recover the same from the employee’s movable and immovable property by\ninstituting legal / court proceedings.\n8.8 If any training is provided to the employee, the company has full rights to recover the expenses\nincurred to train that employee if he/she resigns before completion of 6 months",
      "page_number": 3,
      "method": "regex"
    },
    "probation_months": {
      "value": 6,
      "confidence": 0.9,
      "source_text": "PROBATIONARY PERIOD\nThe probationary period will be of ___________ and the company will evaluate the new hire’s\nqualifications, skills and \"fit\" within our Company. The given time frame does not constitute an\nobligation on the part of the Company to retain the employee until the end of the probationary\nperiod. This period involves special orientation activities plus closer and more frequent\nperformance evaluations than that given to regular employees. During this time or at any time of\nemployment, the Company may terminate the working relationship without cause with advance\nnotice, except as prescribed by law.\nAt the end of the probationary period, if the employee has not been available to work the full\nprobationary period or work performance has not met expectations, the length of the probation\nmay be extended by the Company at its sole discretion.\nUpon satisfactory completion of the probationary period, the employee will achieve a regular or\npart time employee status and as such, will be eligible for most of our benefits (exceptions would\nbe benefits that have a specific waiting period).\nThe employee will now be expected to meet and maintain Company standards for job\nperformance and behavior.\n3. PLACE OF WORK\n3.1 The Employee will be stationed in the Employer’s offices currently located in _________, but the\nCompany shall be entitled to transfer the Employee’s services to any of the branches, sister\nconcerns, which are presently operating or that which may be set up in future, in India or outside\nIndia.\n3.2 The Employee may be required to work at premises other than the Company’s premises from\ntime to time.\n_____________ ___________\n( DIRECTOR) (Post)\n(Name of the Company) EMPLOYEE\n\n4. DUTIES AND POWERS\n4.1 The Employee shall devote his / her efforts and his / her full business time and attention to the\nperformance of such duties and responsibilities as may be assigned to him/her from time to time by the\nDirector of the Company and in this regard follow all instructions issued or given by the Director of the\nCompany or by a Manager immediately Senior to the Employee or by the Board of Directors of the\nCompany.\n4.2 The Employee shall maintain proper dignity of the company’s office and deal the matter with\nsobriety.\n4.3 In performing his /her duties as_____________of the Company the Employee shall adhere to\nall applicable laws and regulations as well as follow the Company’s policies and instructions.\n4.4 The Employee shall devote his/her best efforts and all of his/her business time to the\nperformance of his/her duties under this Employment Agreement and shall perform them\nfaithfully, diligently and competently, in a manner consistent with the policies of the Company as\ndetermined from time to time by the Director of the Company and shall directly report to the\nimmediate Head or Senior in hierarchy. The Employee whilst working with the Company shall\nnot, except with the prior written consent of the Board of Directors engage in activities outside the\nscope of his/her employment and shall fulfill his/her responsibilities or duties under this\nEmployment Agreement.\n4.5 That during the Employment period, the employee without consent of the company in writing\nshall not sign on any documents or commit on behalf of the company without mutual consent. If\nthe employee violates the same, then consequently in case if any liability arises then the\ncompany shall not be responsible for it in any circumstances.\n4.6 As ______________of the Company the Employee shall be responsible for the day-to-day\nmanagement to immediate Head or Senior in hierarchy.\n4.7 That the employee services will be governed by the rules and regulations of the company as in\nforce from time to time and also as per certified model. The Employer can modify the Agreement\nor Rules and Regulations from time to time and the modification will be applicable from the same\nday.\n4.8 It is hereby agreed by and between the Company and the Employee hereto that in case any\nclaim, dispute or difference arises between the Parties with regard to the terms and conditions of\nthis Employment Agreement or relating to the interpretation hereof whether during the\nsubsistence of this Employment Agreement or thereafter, the same shall be referred to the sole\narbitration of a single arbitrator, Mr. __________, in accordance with the provisions of the\nArbitration and Conciliation Act, 1996 or any statutory modification or re-enactment thereof for\nthe time being in force. The arbitration shall be held in Jaipur and the proceedings shall be\nconducted in the Hindi language. The Parties hereby agree that the arbitral award shall be final,\nbinding and conclusive on the Parties to this Employment Agreement.\n5. ANNUAL BASE SALARY\n5.1 The Employee, who is entitled to a salary, will be CTC (as given in salary structure) in\naccordance with the Company’s customary payroll practices.\n5.2 The Employee shall not entitle to get salary, if he/she fails to meet the objectives or targets laid\ndown by the company.\n6. CONFIDENTIALITY\n6.1 The Employee shall not, directly or indirectly, either during the term of the Employee’s\nemployment under this Employment Agreement or thereafter, disclose to anyone (except in the\n\nregular course of the Company’s business or as required by law), or use in any manner, any\ninformation acquired by the Employee during his/her employment by the Company with respect\nto any trade secrets, clients, customers or other confidential information of the Company, its\nsubsidiaries and associate companies world wide, their operations or affairs unless such\ninformation has become public knowledge other than by reason of actions (direct or indirect) of\nthe Employee.\n6.2 As long as the Employee is employed, and also thereafter, he/she shall maintain confidential the\ncorporate secrets and all other information of a confidential nature pertaining to the Company\nand its operations. The Employee may use such information only during his/her employment by\nthe Company and in the interest of the Company. The Employee shall at all times carefully and\ndiligently safeguard and promote the Company’s interests.\n6.3 During the course of employment, any such creation, innovation or any such intellectual property\nin the form of software, hardware etc shall be exclusive property of the company as well the\nsource code of the company shall remain exclusive property of the company. That the employee\nshall not use the source code of the company directly or indirectly. If the company finds that the\nemployee is contravening this term directly or indirectly then the company shall be entitled to\nclaim damages under section 73, 74 of the contract act and also entitled to initiate legal\nproceeding against the employee.\n6.4 That during and after the employment period, the employee will not divulge or appropriate to\nhis/her own use or to the use of others, in competition with the company, any secret or\nconfidential information or knowledge pertaining to the business of the company, or of any of its\nsubsidiaries, obtained by the Employee while employed by the company or any of its\nsubsidiaries.\n6.5 That the Employee will maintain proper dignity as well as decorum of company’s office. The\nEmployee will maintain and keep in his/her safe custody such identity card, documents, files,\nbooks, mobile, laptop, papers etc issued to the Employee and shall return the same whenever\nrequired.\n6.6 The agreement shall revive and apply again from time to time post completion of Two-Year\nperiod.\n6.7 When the Employee’s employment with the Company is terminated, he/she shall return to the\nCompany all business documentation, software, notes etc. and copies thereof pertaining to the\nCompany and its operations that have been entrusted to him/her or to which he/she has access.\n7. NON-COMPETE CLAUSE\n7.1 That the employee after the period of employment is over, shall not open similar nature company\nupto three years directly or indirectly. If the company finds that the employee is contravening this\nterm directly or indirectly, then the company shall be entitled to claim damages under section 73,\n74 of the contract act as well as entitled to initiate appropriate legal proceeding against the\nemployee.\n7.2 That the client or the customer shall be sole client of the company. During the employment\nperiod as well as after the employment period is over, if the company finds out that the employee\nis trying to connect with the client of the company directly or indirectly, then the company shall be\nentitled to claim damages under section 73, 74 of the contract act as well as entitled to initiate\nappropriate legal proceeding against the employee.\n7.3 During the course of employment, employee shall not do any personal work or for any third party\notherwise it will become a ground for termination and compensation clause will apply.\n8. TERM OF CONTRACT, TERMINATION OF EMPLOYMENT AND SEVERANCE PAY\n8.1 This Employment Agreement shall continue until terminated by either Party as provided herein\nand supersedes any and all prior oral or written agreements pertaining to the duration,\n\ncompensation and conditions of employment of the Employee.\n8.2 The Employee may lawfully terminate this Employment Agreement by giving to the Employer not\nless than notice in writing and the employee shall not be entitled to get the salary of the notice\nperiod and on break of bond of two years the employee is liable to pay penalty equal to Rs. 2\nlakhs. Employer can terminate the employee any time with immediate effect without giving any\nNotice Period.\n8.3 In case if the employee leaves the company or terminates his/her employment before\ncompletion of two years, then he/she is liable to pay penalty equal to Rs. 2 lakhs. Since the\nEmployer’s company is a software developing company as well as a reputed Training Academy\nthat enjoys tremendous goodwill in the market. Since, a lot of time, energy and effort is devoted\nand invested in grooming young aspiring Employees which is essential in bringing out the best of\ntalent in them and nurturing them to make them able, competent and successful professionals.\n8.4 No severance pay, as mentioned above, will be made to the Employee in case the Company has\nterminated the Employee’s employment due to his/her breach of Agreement or if he/she do not\nmeet the performance criteria prescribed by the Company.\n8.5 All memoranda, notes, records, or other documents made or composed by the Employee, or\nmade available to him/her during the term of this Employment Agreement concerning or in any\nway relating to the business or affairs of the Company, its subsidiaries, divisions, affiliates, or\nclients shall be the Company’s property and shall be delivered to the Company on the\ntermination of this Employment Agreement or at any other time at the request of the Company.\n8.6 That if the employee commits any offence punishable under the Indian Law even outside the\ncompany or with the customer outside the course of employment, the company shall not be\nresponsible for it in any circumstances.\n8.7 That during the course of employment, if the employee commits any fraud with the company and\nas a result of which the company suffers huge loss, in case of such an event, the Employer shall\nbe entitled to recover the same from the employee’s movable and immovable property by\ninstituting legal / court proceedings.\n8.8 If any training is provided to the employee, the company has full rights to recover the expenses\nincurred to train that employee if he/she resigns before completion of 6 months",
      "page_number": 1,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "8.6 That if the employee commits any offence punishable under the Indian Law even outside the\ncompany or with the customer outside the course of employment, the company shall not be\nresponsible for it in any circumstances.",
        "evidence": {
          "value": 222,
          "confidence": 0.7,
          "source_text": "termination of this Employment Agreement or at any other time at the request of the Company.\n8.6 That if the employee commits any offence punishable under the Indian Law even outside the\ncompan",
          "page_number": 4,
          "method": "regex"
        }
      },
      "non_compete": {
        "text": "7.1 That the employee after the period of employment is over, shall not open similar nature company\nupto three years directly or indirectly. If the company finds that the employee is contravening this\nterm directly or indirectly, then the company shall be entitled to claim damages under section 73,\n74 of the contract act as well as entitled to initiate appropriate legal proceeding against the\nemployee.",
        "evidence": {
          "value": 405,
          "confidence": 0.7,
          "source_text": "NON-COMPETE CLAUSE\n7.1 That the employee after the period of employment is over, shall not open similar nature company\n",
          "page_number": 3,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "6.1 The Employee shall not, directly or indirectly, either during the term of the Employee’s\nemployment under this Employment Agreement or thereafter, disclose to anyone (except in the\n\nregular course of the Company’s business or as required by law), or use in any manner, any\ninformation acquired by the Employee during his/her employment by the Company with respect\nto any trade secrets, clients, customers or other confidential information of the Company, its\nsubsidiaries and associate companies world wide, their operations or affairs unless such\ninformation has become public knowledge other than by reason of actions (direct or indirect) of\nthe Employee.",
        "evidence": {
          "value": 661,
          "confidence": 0.7,
          "source_text": "CONFIDENTIALITY\n6.1 The Employee shall not, directly or indirectly, either during the term of the Employee’s\nemploym",
          "page_number": 2,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 20
}