{
  "contract_id": "f2144c9355c12155",
  "filename": "22-23-Copy-of-internship-merged_compressed.pdf",
  "file_hash": "f2144c9355c1215568d334aca951d8052200d8d3ae4eace93a39853ae702286c",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": 150000.0,
      "confidence": 0.9,
      "source_text": "1.50 Lac",
      "page_number": 126,
      "method": "regex"
    },
    "notice_period_days": {
      "value": 30,
      "confidence": 0.9,
      "source_text": "1 month notice",
      "page_number": 146,
      "method": "regex"
    },
    "bond_amount_inr": {
      "value": 8.0,
      "confidence": 0.9,
      "source_text": "liquidated damages to the Company of\nan extent estimated by the Company.\n7. Under normal circumstances either the company or you may terminate this\nassociation by providing a notice of 15 days without assigning any reason. However,the\ncompany may terminate this agreement forthwith under situations of in-disciplinary\nbehaviors.\n8",
      "page_number": 66,
      "method": "regex"
    },
    "non_compete_months": {
      "value": 24,
      "confidence": 0.9,
      "source_text": "Non-Compete.\nThe Employee agrees that at no time will the Employee engage in any business activity which is\ncompetitive with the Startup, nor work for any Startup which competes with the Startup:\n☐ During the term of the Employee’s relationshipwith the Startup.\n7.Non-Solicitation.\nThe Employee agrees not to solicit any employee or independent contractor of the Startup on behalf of\nany other business enterprise, nor shall the Employee induce any employee or independent contractor\nassociated with the Startup to terminate or breach an employment, contractual or other relationship with\nthe Startup:\n\n8. Disclaimer. There is no representation or warranty, express or implied, made by the Startup as to the\naccuracy or completeness of any of its Confidential Information.\n9. Remedies. The Employee acknowledges that use ordisclosure of any Confidential Information in a\nmanner inconsistent with this Agreement will give rise to irreparable injury for which damages would not\nbe an adequate remedy. Accordingly, in addition to any other legal remedies which may be available at\nlaw or in equity, the Startup shall be entitled to equitable or injunctive relief against the unauthorized use\nor disclosure of Confidential Information. The Startup shall be entitled to pursue any other legally\npermissible remedy available as a result of such breach, including but not limited to damages, both direct\nand consequential. In any action brought by the Company under this Section, the Startup shall be entitled\nto recover its attorney’s fees and costs from the Employee.\n10. Notices. All notices given under this Agreement must be in writing. A notice is effective upon receipt\nand shall be sent via one of the following methods: delivery in person, overnight courier service, certified\nor registered mail, postage prepaid, return receipt requested, addressed to the party to be notified at the\nbelow address or by facsimile at the below facsimile number or in the case of either party, to such other\nparty, address or facsimile number as such party may designate upon reasonable notice to the other\nparty.\nDisclosing Party\nName: Devaki Jagan Sai rohan\nTitle: Founder\nAddress: Flat no.402, 1-2-376,street no.6, domalguda ,himayathnagar, Hyderabad,500029, Telangana\nReceiving Party\nName: Rajkaran Mishra\nTitle: Employee\nAddress: 001, A, Siddhivinayak Apt, vasai (w), Maharashtra\nPhone number: 8263994073\n11. Termination. This Agreement will terminate on the earlier of:\n(a) the written agreement of the parties to terminate this Agreement;\n(b) the cessation of the Employee's employment; or\n(c) _____May 7th,2021_____ (Check one) ☐ months ☐ years from the date hereof.\n12. Amendment.This Agreement may be amended or modified only by a written agreement signed by\nboth of the parties.\n13. Jurisdiction. This Agreement will be governed by and construed in accordance with the laws of the\nState of ______Telangana___________, without regard to the principles of conflict of laws. Each party\nconsents to the exclusive jurisdiction of the courts located in the State of ______Telangaga___________\nfor any legal action, suit or proceeding arising out of or in connection with this Agreement. Each party\nfurther waives any objection to the laying of venue for any such suit, action or proceeding in such courts.\n14.No Offer or Sale.Nothing in this Agreement will be deemed a sale or offer for sale of Confidential\nInformation nor obligate the Startup to grant the Employee a license or any rights, by statute, common law\ntheory of estoppel or otherwise, to Confidential Information.\n15. Miscellaneous.No joint venture, partnershipor agency relationship exists between the Employee,\nthe Startup or any third-party as a result of this Agreement. This Agreement will inure to the benefit of and\nbe binding on the respective successors and permitted assigns of the parties. Neither party may assign its\nrights or delegate its duties under this Agreement without the other party’s prior written consent. In the\n\nevent that any provision of this Agreement is held to be invalid, illegal or unenforceable in whole or in part,\nthe remaining provisions shall not be affected and shall continue to be valid, legal and enforceable as\nthough the invalid, illegal or unenforceable parts had not been included in this Agreement. Neither party\nwill be charged with any waiver of any provision of this Agreement, unless such waiver is evidenced by a\nwriting signed by the party and any such waiver will be limited to the terms of such writing.\nIN WITNESS WHEREOF, the parties hereto have executed this Agreement as of the date first written\nabove.\nRajkaran Vijay Mishra\nEmployee Signature Employee Full Name\nDevaki Jagan Sai Rohan\nEmployerSignature EmployerFull Name\nDevaki Jagan Sai Rohan (FOUNDER)\nStartupRepresentativeSignature StartupRepresentativeName and Title\n\nStudyOwl Education Private Limited\nConsultant Agreement\nAugust 10, 2022\nTo,\nMr. Vraj Patel & Mr. Kashyap Patel,\nDear Vraj & Kashyap,\nWe are pleased to confirm our agreement in your appointment as a “Consultant”\noffering consultation for Developing a flutter application by StudyOwl Education\nPlatform Private Limited (Company”). Set below are the terms and conditions\nrelating to your appointment as a Consultant and remuneration in the form of\nconsultation/professional fee to be paid as are fee hereinafter referred to as “Terms\nand Conditions of Agreement for consultation ”).StudyOwl and\nConsultant shall collectively be called the “Parties” and individually as the “Party”.\n1. APPOINTMENT & TERM\n1.1 This Agreement shall become effective from August 10, 2022 and shall\ncontinue unless terminated earlier in accordance with the terms hereof. On\nthe expiry of the Term of this Agreement, Parties may extend the Term of\nthis Agreement for such period and on such terms as mutually determined.\n2. SCOPE OF SERVICES\n2.1 The Consultant hereby shall provide the consultation services and in the\ntime and manner as set out in Annexure A of the Agreement (hereinafter\ncollectively referred to as the “Services”).\n3. Consideration and Manner of Payment\n3.1 Your Consultation/Professional fee would be paid as per the payment\ntimeline\nhereinafter referred to as the “Consultation Charges”\nCIN U80904TG2016PTC103797\n11-10-694/B/1, Near R. R. High School, Burhanpuram, Ward No. 2, Khammam - 507001 Mobile : +91-\n9738074729\n\nStudyOwl Education Private Limited\n4. Notice of Termination of agreement for Consultation\n4.1 You may terminate your agreement for consultation during the Term by\ngiving one-month notice in writing to the Company.\n4.2 The Company may terminate your agreement during the Term by giving you\none-month notice in writing.\n6. Confidentiality\n6.1 You shall perpetually treat as strictly confidential all records, data, and\nother information that comes within his/her knowledge during the\nconsultation Term. Further, you shall not copy, reproduce and/or disclose\nany of the Confidential Information to any other party without the prior\nwritten consent of the Company. The term “Confidential Information”\nincludes, but is not limited to the following information, whether in oral,\nwritten, diskette, graphic or machine readable form: (a) information or\nmaterial proprietary to the Company, including, but not limited to,\ninformation relating to the business affairs of the Company and/or any of\nits customers, clients, vendors, suppliers, consultants, employees,\ndistributors or service providers, (b) information designated as confidential\nby the Company, (c) information about the Company and/or its business\nacquired by the consultant by virtue of his/her agreement for consultation\nwith the Company, (d) information created, discovered, developed or\nmade known to the Company by the consultant during the period of or\narising out of the consultancy period’s performance of his/her obligations,\n(e) trade secrets of the Company; (f) policies, employee names, onboard\nteam’s names or information, consultant\nnames or information, customer base, manuals, designs, procedures, formulas,\ndiscoveries, inventions, improvements, concepts, ideas, future plans and\nbudgets, unannounced organizational or staffing changes, financial analysis,\ncompetitive analysis, management information, technical data and market\nstudies; and (g) any other information imparted in confidence to the consultant by\nthe Company. “Confidential Information” shall not include information which is\nCIN U80904TG2016PTC103797\n11-10-694/B/1, Near R. R. High School, Burhanpuram, Ward No. 2, Khammam - 507001 Mobile : +91-\n9738074729\n\nStudyOwl Education Private Limited\nnow, or which hereafter, becomes, through no wrongful act or omission on the\npart of the consultant in the public domain.\n6.2 You must not anywhere, at any time after termination of your services or\ncompletion of the agreement term with the Company, either personally or\nthrough agents, friends or relatives, directly or indirectly, represent yourself\nas being connected to the business of the Company unless you have\nobtained prior consent from the Company for such representation. In the\nevent of breach of any of the conditions mentioned above, the Company\nshall be entitled to injunctive relief and / or specific performance of the\nTerms and Conditions of this agreement.\n6.3 On the date of termination of consultation agreement with the Company or\nat such time as directed by the Company, you shall return to the Company\nall Confidential Information furnished by the Company and shall not retain\nduplicates or other record of such information. Further, you shall complete\ndestruction of all written material, memoranda, notes, and other writings or\ndigital and electronic recordings whatsoever based upon the Confidential\nInformation, wherever located and, you shall give a written certification for\nsuch destruction.\n7. Non Solicitation of Students, Consultants and Employees andNon\nCompete\n7.1 You will not for a period of two year after termination of your consultation\nterm agreement solicit or entice away or engage from The Company or\noffer or cause to be offered any employment to any person employed by\nthe Company, consultants performing services for the Company or to any\nstudents (in the context of the region based workshops only) that you have\ninteracted with in performance of your services for the Company during\nthe last 24 months",
      "page_number": 21,
      "method": "regex"
    },
    "probation_months": {
      "value": 24,
      "confidence": 0.9,
      "source_text": "probation for a period of (1) month and will be confirmed after this period, if your\nwork and conduct are found satisfactory. The Management reserves the right either to extend the\nprobationary period or to dispense with your services at any time during the period by a written\nnotice of twenty Four (24) hours if your performance or conduct, at the discretion of the\nManagement, does not come up to its expectations.\n2. SERVICE RULES\nYour services with the Company will be governed by the Company’s rules in force from time to\ntime. The principal terms & conditions of the service rules in force at present are as follows:\nYou shall act with professionalism, honesty, discipline and integrity, as well as high moral and\nethical standards in the performance of your obligations and in all your business relationship\nwith others. Any misconduct and harassment at work shall be brought to the notice of the\nconcerned officers and necessary action will be taken in accordance with law and the\ncompany’s Code of conduct.\nYour appointment is being made on the basis of particulars declared by you in the personal\ninformation form and in case any information as given by you is found to be false or incorrect,\nyour appointment will be deemed to be void and liable for termination without any notice or\nsalary in lieu of notice.\nYour working hours shall be governed by that of the establishment to which you are attached.\nThere may be occasions where you may have to work beyond normal working hours due to\nexigencies of the company’s business and you may also required to work in shift.\nKNS BIZ MANAGEMENT\nCorrespondent Address: 29/A, Kurla Kamgar Nagar CHSL, Kamgar Nagar, Kurla East, Mumbai 400024, Maharashtra\nContact: 82865 87999| Email ID: support@businessrights.in\nwww.businessrights.in\n\nZoho Sign Document ID: TBIWMANSK6FT4IB6WJB13E9RMDPZYKV-_RH3OSIT0WQ\nBusinessRights\nDuring the period of your employment with the company, you shall not engage in any other\nprofession or business, nor shall you seek employment outside except with prior permission of\nthe Management. You will always Endeavour your best to promote the Company’s interests.\nYou will not engage in any activity which against government law during the term of\nemployment, failing to which immediate termination of service and company will not liable in\nsuch case.\nYou will at all times maintain complete secrecy about the Company’s business affairs, inventions,\nspecial manufacturing techniques, secret processes and the like which may have come to your\nknowledge during the period of your employment.\nDuring your employment, you will not, without the written authority of the Company, publish any\nwritten articles or deliver any talk on any subject related to your professions and / or work at\nCompany or participate as a member of any organisation connected with your profession.\nYou are required to keep and render a faithful account of all properties of the Company\nentrusted to you in the course of your employment.\nYou will inform the Company immediately regarding any inventions, patents, processes etc. that\nyou may make or discover during your employment with the Company and the Company shall\nhave the right to take over the patents or processes or inventions on payment of such sums as\nmay be considered reasonable by the Company.\nYou may be transferred to any of the Company’s establishments situated in any part of India or\nabroad. On your transfer, you will be governed by the Company’s rules applicable to the\nestablishment to which you are posted.\n3. PERFORMANCE REVIEW\nYou may be considered for suitable rise/increment based on your overall performance progress,\nsubject to Company’s overall profitability status.\nYou will work under supervision of such Officers as may be declared up on by the management from\ntime to time.\nYou shall diligently and satisfactorily carry out instructions given to you by your superiors in\nconnection with the work assigned to you to the best of your potentialities, skill and ability.\n4. STATUS\nYou are expected to keep the Company informed about any change in your address, marital status\nor your qualifications during your tenure with Company.\nKNS BIZ MANAGEMENT\nCorrespondent Address: 29/A, Kurla Kamgar Nagar CHSL, Kamgar Nagar, Kurla East, Mumbai 400024, Maharashtra\nContact: 82865 87999| Email ID: support@businessrights.in\nwww.businessrights.in\n\nZoho Sign Document ID: TBIWMANSK6FT4IB6WJB13E9RMDPZYKV-_RH3OSIT0WQ\nBusinessRights\n5. SEPARATION\nYour service contract can be terminated by either the Company or yourself, without assigning any\nreason, by a written notice of thirty (15) days & for that month complete salary will process with\nFNF. In case of non-fulfillment of notice period FNF & Certification will not be process.\nThe company is at Liberty to recover damages or loss so incurred to the person properly of the\ncompany due to your act and omission as stated above or otherwise shall be recovered from your\nsalary or emoluments or any other benefits,etc. to the extent of loss and damages so caused, as\nper law.\n6. COMPENSATION\nYou are entitled of the “ Rupees Two Thousand” stipend every month paid directly to bank account.\nI have read the aforesaid Terms and Conditions and all Annexures and understood all the terms\nand conditions mentioned there in and I hereby unconditionally accept and agree to abide by\nthem:\n___________________________\nShahima Firoz Khan\nTrainee – Digital Marketing Operations.\nKNS BIZ MANAGEMENT\nCorrespondent Address: 29/A, Kurla Kamgar Nagar CHSL, Kamgar Nagar, Kurla East, Mumbai 400024, Maharashtra\nContact: 82865 87999| Email ID: support@businessrights.in\nwww.businessrights.in\n\nEMPLOYEE NON-DISCLOSURE\nAND CONFIDENTIALITY AGREEMENT\nThis Employee Non-Disclosure and Confidentiality Agreement is entered into as of the 15 June\n2022 to 15 September, 2022 (the “Effective Date”) by and between:\nEmployer:_______Devaki Jagan Sai Rohan_________________,an☐ Individual\nEmployee:Rajkaran Mishra, an employee of the Papersdrop\nThe Startup hired the Employee as React Developer [Position] pursuant to the terms and conditions\nof that certain Employment Agreement executed between the Parties on the 90 day of 16 June, 2022\n(the \"Employment Agreement\"). In connection with the Employee's duties under the Employment\nAgreement, the Startup may disclose to the Employee certain confidential and proprietary information\nunique and valuable to its ongoing business operations. In consideration of the Employee's employment\nby the Startup and the covenants and mutual promises contained herein, the parties agree as follows:\n1. Confidential Information. Confidential informationis:\n☐ All information shared by the Startup.\"ConfidentialInformation\" shall mean (i) all information\nrelating to the Startup products, business and operations including, but not limited to, financial documents\nand plans, customers, suppliers, manufacturing partners, marketing strategies, vendors, products,\nproduct development plans, technical product data, product samples, costs, sources, strategies,\noperations procedures, proprietary concepts, inventions, sales leads, sales data, customer lists, customer\nprofiles, technical advice or knowledge, contractual agreements, price lists, supplier lists, sales estimates,\nproduct specifications, trade secrets, distribution methods, inventories, marketing strategies, source code,\nsoftware, algorithms, data, drawings or schematics, blueprints, computer programs and systems and\nknow-how or other intellectual property of the Startup and its affiliates that may be at any time furnished,\ncommunicated or delivered by the Startup to the Employee, whether in oral, tangible, electronic or other\nform; (ii) the terms of any agreement, including this Agreement, and the discussions, negotiations and\nproposals related to any agreement; (iii) information acquired during any tours of the Startup facilities; and\n(iv) all other non-public information provided by the Startup whosoever. All Confidential Information shall\nremain the property of the Startup.\n☐ Specific information.The term “Confidential Information”as used in this Agreement shall mean any\ndata or information that is competitively sensitive material and not generally known to the public,\nincluding, but not limited to, information relating to any of the following, which the Startup considers\nconfidential:\n☐ 'Accounting Information' which includes all books,tax returns, financial information, financial\nforecasts, pricing lists, purchasing lists and memos, pricing forecasts, purchase order information,\nsupplier costs and discounts, or related financial or purchasing information.\n☐ 'Business Operations' which includes all processes,proprietary information or data, ideas or the\nlike, either in existence or contemplated related to the Startup daily and long-term plans for conducting\nthe Startup business.\n\n☐ 'Computer Technology' which includes all computerhardware, software or other tangible and\nintangible equipment or code either in existence or development.\n☐ 'Customer Information' which includes the namesof entities or individuals, including their affiliates\nand representatives, that the Startup provides and sells its services or goods to, as well as any\nassociated information, including but not limited to, leads, contact lists, sales plans and notes, shared\nand learned sales information such as pricing sheets, projections or plans, agreements, or such other\ndata.\n☐ 'Intellectual Property' which includes patents,trademarks, service marks, logos, trade names,\ninternet or website domain names, rights in designs and schematics, copyrights (including rights in\ncomputer software), moral rights, database rights, in each case whether registered or unregistered\nand including applications for registration, in all rights or forms anywhere in the world.\n☐ 'Marketing and Sales Information' which includesall customer leads, sales targets, sales markets,\nadvertising materials, sales territories, sales goals and projections, sales and marketing processes or\npractices, training manuals or other documentation and materials related to the sales, marketing and\npromotional activities of the the Startup and its products or services.\n☐ 'Proprietary Rights’ which includes any and all rights, whether registered or unregistered, in and\nwith respect to patents, copyrights, trade names, domain names, logos, trademarks, service marks,\nconfidential information, know-how, trade secrets, moral rights, contract or licensing rights, whether\nprotected under contract or otherwise under law, and other similar rights or interests in intellectual\nproperty.\n☐ 'Procedures and Specifications' which includesall procedures and other specifications, criteria,\nstandards, methods, instructions, plans or other directions prescribed by the Startup for the\nmanufacture, preparation, packaging and labelling, and sale of its products or services.\n☐ 'Product Information' which includes the Startupproducts which are being contemplated for sale,\nmanufactured, marketed, listed, or sold, including any fixes, revisions, upgrades, or versions, of which\nconsists of all data, software and documentation related thereto.\n☐ 'Service Information' which means the servicesprovided by the Startup, including the method,\ndetails, means, skills and training, which consists of all data, software and documentation related\nthereto.\n☐ 'Software Information' which means the proprietarycomputer programs of the Startup, including all\nfixes, upgrades, new versions, new enhancements, modifications, edits, conversions, replacements,\nor the like, in machine readable form or documentation and materials, and all copies and translations\nof such computer programs, documentation and materials, regardless of the form or media of\nexpression or storage.\n2. Stipend or Salary: Employee has agreed to workas an intern and there will not be any stipend given\nto the Employee, during the term of Employee’s relationship with the Startup.\n3.Duration of Internship:\nEmployee has agreed to work as an intern for the duration of ____3____months\n4. Exclusions from Confidential Information.Theobligation of confidentiality with respect to\nConfidential Information will not apply to any information:\na. If the information is or becomes publicly known and available other than as a result of prior\nunauthorized disclosure by the Employee;\n\nb. If the information is or was received by the Employee from a third-party source which, to the best\nknowledge of the Employee, is or was not under a confidentiality obligation to the Startup with regard\nto such information;\nc. If the information is disclosed by the Employee with the Startup prior written permission and\napproval;\nd. If the information is independently developed by the Employee prior to disclosure by the Company\nand without the use and benefit of any of the Startup Confidential Information; or\ne. If the Employee may disclose only such portion of the Confidential Information which it is legally\nobligated to disclose the Employee is legally compelled by applicable law, by any court, governmental\nagency, or regulatory authority or subpoena or discovery request in pending litigation, but only if, to the\nextent lawful, the Employee gives prompt written notice of that fact to the Startup prior to disclosure so\nthat the Startup may request a protective order or other remedy, the Employee may disclose only such\nportion of the Confidential Information which it is legally obligated to disclose.\n5. Obligation to Maintain Confidentiality.With respectto Confidential Information:\na. The Employee agrees to retain the Confidential Information in strict confidence, to protect the\nsecurity, integrity, and confidentiality of such information and to not permit unauthorized access to or\nunauthorized use, disclosure, publication, or dissemination of Confidential Information except in\nconformity with this Agreement.\nb. Confidential Information is and will remain the sole and exclusive property of the Startup and will\nnot be disclosed or revealed by the Employee, except (i) to other employees of the Startup who have\na need to know such information and agree to be bound by the terms of this Agreement.\nc. The Employee agrees that, in the event the Employee must download, access, process, transfer or\notherwise communicate Confidential Information, the Employee will comply with all laws and\nregulations applicable to exports and re-exports of data and information and will not, directly or\nindirectly, export or re-export any Confidential Information in violation of such laws and regulations,\nincluding without limitation, those prohibiting export or re-export to restricted countries or without\ngovernmental authorization.\nd. Upon termination of this Agreement or at the request of the Startup, the Employee will ensure that\nall Confidential Information and all documents, memoranda, notes and other writings or electronic\nrecords prepared by the Employee that include or reflect any Confidential Information in the\nEmployee’s actual or constructive possession are returned to the Startup.\ne. The obligation not to disclose Confidential Information shall:\n☐ Survive the termination of this Agreement, and at no time will the Employee be permitted to\ndisclose Confidential Information, except to the extent that such Confidential Information is excluded\nfrom the obligations of confidentiality under this Agreement pursuant to Paragraph 2 above.\n6.Non-Compete.\nThe Employee agrees that at no time will the Employee engage in any business activity which is\ncompetitive with the Startup, nor work for any Startup which competes with the Startup:\n☐ During the term of the Employee’s relationshipwith the Startup.\n7.Non-Solicitation.\nThe Employee agrees not to solicit any employee or independent contractor of the Startup on behalf of\nany other business enterprise, nor shall the Employee induce any employee or independent contractor\nassociated with the Startup to terminate or breach an employment, contractual or other relationship with\nthe Startup:\n\n8. Disclaimer. There is no representation or warranty, express or implied, made by the Startup as to the\naccuracy or completeness of any of its Confidential Information.\n9. Remedies. The Employee acknowledges that use ordisclosure of any Confidential Information in a\nmanner inconsistent with this Agreement will give rise to irreparable injury for which damages would not\nbe an adequate remedy. Accordingly, in addition to any other legal remedies which may be available at\nlaw or in equity, the Startup shall be entitled to equitable or injunctive relief against the unauthorized use\nor disclosure of Confidential Information. The Startup shall be entitled to pursue any other legally\npermissible remedy available as a result of such breach, including but not limited to damages, both direct\nand consequential. In any action brought by the Company under this Section, the Startup shall be entitled\nto recover its attorney’s fees and costs from the Employee.\n10. Notices. All notices given under this Agreement must be in writing. A notice is effective upon receipt\nand shall be sent via one of the following methods: delivery in person, overnight courier service, certified\nor registered mail, postage prepaid, return receipt requested, addressed to the party to be notified at the\nbelow address or by facsimile at the below facsimile number or in the case of either party, to such other\nparty, address or facsimile number as such party may designate upon reasonable notice to the other\nparty.\nDisclosing Party\nName: Devaki Jagan Sai rohan\nTitle: Founder\nAddress: Flat no.402, 1-2-376,street no.6, domalguda ,himayathnagar, Hyderabad,500029, Telangana\nReceiving Party\nName: Rajkaran Mishra\nTitle: Employee\nAddress: 001, A, Siddhivinayak Apt, vasai (w), Maharashtra\nPhone number: 8263994073\n11. Termination. This Agreement will terminate on the earlier of:\n(a) the written agreement of the parties to terminate this Agreement;\n(b) the cessation of the Employee's employment; or\n(c) _____May 7th,2021_____ (Check one) ☐ months ☐ years from the date hereof.\n12. Amendment.This Agreement may be amended or modified only by a written agreement signed by\nboth of the parties.\n13. Jurisdiction. This Agreement will be governed by and construed in accordance with the laws of the\nState of ______Telangana___________, without regard to the principles of conflict of laws. Each party\nconsents to the exclusive jurisdiction of the courts located in the State of ______Telangaga___________\nfor any legal action, suit or proceeding arising out of or in connection with this Agreement. Each party\nfurther waives any objection to the laying of venue for any such suit, action or proceeding in such courts.\n14.No Offer or Sale.Nothing in this Agreement will be deemed a sale or offer for sale of Confidential\nInformation nor obligate the Startup to grant the Employee a license or any rights, by statute, common law\ntheory of estoppel or otherwise, to Confidential Information.\n15. Miscellaneous.No joint venture, partnershipor agency relationship exists between the Employee,\nthe Startup or any third-party as a result of this Agreement. This Agreement will inure to the benefit of and\nbe binding on the respective successors and permitted assigns of the parties. Neither party may assign its\nrights or delegate its duties under this Agreement without the other party’s prior written consent. In the\n\nevent that any provision of this Agreement is held to be invalid, illegal or unenforceable in whole or in part,\nthe remaining provisions shall not be affected and shall continue to be valid, legal and enforceable as\nthough the invalid, illegal or unenforceable parts had not been included in this Agreement. Neither party\nwill be charged with any waiver of any provision of this Agreement, unless such waiver is evidenced by a\nwriting signed by the party and any such waiver will be limited to the terms of such writing.\nIN WITNESS WHEREOF, the parties hereto have executed this Agreement as of the date first written\nabove.\nRajkaran Vijay Mishra\nEmployee Signature Employee Full Name\nDevaki Jagan Sai Rohan\nEmployerSignature EmployerFull Name\nDevaki Jagan Sai Rohan (FOUNDER)\nStartupRepresentativeSignature StartupRepresentativeName and Title\n\nStudyOwl Education Private Limited\nConsultant Agreement\nAugust 10, 2022\nTo,\nMr. Vraj Patel & Mr. Kashyap Patel,\nDear Vraj & Kashyap,\nWe are pleased to confirm our agreement in your appointment as a “Consultant”\noffering consultation for Developing a flutter application by StudyOwl Education\nPlatform Private Limited (Company”). Set below are the terms and conditions\nrelating to your appointment as a Consultant and remuneration in the form of\nconsultation/professional fee to be paid as are fee hereinafter referred to as “Terms\nand Conditions of Agreement for consultation ”).StudyOwl and\nConsultant shall collectively be called the “Parties” and individually as the “Party”.\n1. APPOINTMENT & TERM\n1.1 This Agreement shall become effective from August 10, 2022 and shall\ncontinue unless terminated earlier in accordance with the terms hereof. On\nthe expiry of the Term of this Agreement, Parties may extend the Term of\nthis Agreement for such period and on such terms as mutually determined.\n2. SCOPE OF SERVICES\n2.1 The Consultant hereby shall provide the consultation services and in the\ntime and manner as set out in Annexure A of the Agreement (hereinafter\ncollectively referred to as the “Services”).\n3. Consideration and Manner of Payment\n3.1 Your Consultation/Professional fee would be paid as per the payment\ntimeline\nhereinafter referred to as the “Consultation Charges”\nCIN U80904TG2016PTC103797\n11-10-694/B/1, Near R. R. High School, Burhanpuram, Ward No. 2, Khammam - 507001 Mobile : +91-\n9738074729\n\nStudyOwl Education Private Limited\n4. Notice of Termination of agreement for Consultation\n4.1 You may terminate your agreement for consultation during the Term by\ngiving one-month notice in writing to the Company.\n4.2 The Company may terminate your agreement during the Term by giving you\none-month notice in writing.\n6. Confidentiality\n6.1 You shall perpetually treat as strictly confidential all records, data, and\nother information that comes within his/her knowledge during the\nconsultation Term. Further, you shall not copy, reproduce and/or disclose\nany of the Confidential Information to any other party without the prior\nwritten consent of the Company. The term “Confidential Information”\nincludes, but is not limited to the following information, whether in oral,\nwritten, diskette, graphic or machine readable form: (a) information or\nmaterial proprietary to the Company, including, but not limited to,\ninformation relating to the business affairs of the Company and/or any of\nits customers, clients, vendors, suppliers, consultants, employees,\ndistributors or service providers, (b) information designated as confidential\nby the Company, (c) information about the Company and/or its business\nacquired by the consultant by virtue of his/her agreement for consultation\nwith the Company, (d) information created, discovered, developed or\nmade known to the Company by the consultant during the period of or\narising out of the consultancy period’s performance of his/her obligations,\n(e) trade secrets of the Company; (f) policies, employee names, onboard\nteam’s names or information, consultant\nnames or information, customer base, manuals, designs, procedures, formulas,\ndiscoveries, inventions, improvements, concepts, ideas, future plans and\nbudgets, unannounced organizational or staffing changes, financial analysis,\ncompetitive analysis, management information, technical data and market\nstudies; and (g) any other information imparted in confidence to the consultant by\nthe Company. “Confidential Information” shall not include information which is\nCIN U80904TG2016PTC103797\n11-10-694/B/1, Near R. R. High School, Burhanpuram, Ward No. 2, Khammam - 507001 Mobile : +91-\n9738074729\n\nStudyOwl Education Private Limited\nnow, or which hereafter, becomes, through no wrongful act or omission on the\npart of the consultant in the public domain.\n6.2 You must not anywhere, at any time after termination of your services or\ncompletion of the agreement term with the Company, either personally or\nthrough agents, friends or relatives, directly or indirectly, represent yourself\nas being connected to the business of the Company unless you have\nobtained prior consent from the Company for such representation. In the\nevent of breach of any of the conditions mentioned above, the Company\nshall be entitled to injunctive relief and / or specific performance of the\nTerms and Conditions of this agreement.\n6.3 On the date of termination of consultation agreement with the Company or\nat such time as directed by the Company, you shall return to the Company\nall Confidential Information furnished by the Company and shall not retain\nduplicates or other record of such information. Further, you shall complete\ndestruction of all written material, memoranda, notes, and other writings or\ndigital and electronic recordings whatsoever based upon the Confidential\nInformation, wherever located and, you shall give a written certification for\nsuch destruction.\n7. Non Solicitation of Students, Consultants and Employees andNon\nCompete\n7.1 You will not for a period of two year after termination of your consultation\nterm agreement solicit or entice away or engage from The Company or\noffer or cause to be offered any employment to any person employed by\nthe Company, consultants performing services for the Company or to any\nstudents (in the context of the region based workshops only) that you have\ninteracted with in performance of your services for the Company during\nthe last 24 months",
      "page_number": 16,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "(a) the written agreement of the parties to terminate this Agreement;\n(b) the cessation of the Employee's employment; or\n(c) _____May 7th,2021_____ (Check one) ☐ months ☐ years from the date hereof.",
        "evidence": {
          "value": 198,
          "confidence": 0.7,
          "source_text": "Termination. This Agreement will terminate on the earlier of\n(a) the written agreement of the parties to terminate this Agreement;\n(b) the cessation of the Emplo",
          "page_number": null,
          "method": "regex"
        }
      },
      "ip": {
        "text": "You agree that all intellectual property, including without limitation inventions,\nimprovements, ideas and discoveries, whether patentable, copyrightable and/or\nreduced to tangible form (collectively hereinafter “Intellectual Property”) made by\nyou during the completion of consultation Term, either alone or jointly with any\nother person(s), whether or not during regular business hours, which relate to or\nare connected or are capable of being worked in connection with the Company’s\nbusiness activities, are the sole property of the Company. You will disclose fully to\nthe Company such Intellectual Property, both while in the service of the Company",
        "evidence": {
          "value": 652,
          "confidence": 0.7,
          "source_text": "Intellectual Property\nYou agree that all intellectual property, including without limitation inventions,\nimprovements, ide",
          "page_number": 27,
          "method": "regex"
        }
      },
      "non_compete": {
        "text": "The Employee agrees that at no time will the Employee engage in any business activity which is\ncompetitive with the Startup, nor work for any Startup which competes with the Startup:\n☐ During the term of the Employee’s relationshipwith the Startup.",
        "evidence": {
          "value": 248,
          "confidence": 0.7,
          "source_text": "Non-Compete.\nThe Employee agrees that at no time will the Employee engage in any business activity which is\ncompe",
          "page_number": 21,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "6.1 You shall perpetually treat as strictly confidential all records, data, and\nother information that comes within his/her knowledge during the\nconsultation Term. Further, you shall not copy, reproduce and/or disclose",
        "evidence": {
          "value": 218,
          "confidence": 0.7,
          "source_text": "Confidentiality\n6.1 You shall perpetually treat as strictly confidential all records, data, and\nother information th",
          "page_number": 25,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 433
}