{
  "contract_id": "f6d551deec50d4f0",
  "filename": "21_Euro_India_Diya_Dhanani.pdf",
  "file_hash": "f6d551deec50d4f00d02cd98016589f491bc22664e15b9ba9c764c769ac4abd9",
  "extraction": {
    "role": null,
    "company_type": null,
    "experience_level": null,
    "ctc_inr": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "notice_period_days": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "bond_amount_inr": {
      "value": 7.0,
      "confidence": 0.9,
      "source_text": "bond or other\nsecurity being required.\n5\n\n11) Amendment and Termination\na. In case the Employer terminates the employment without just cause, in\nwhich case the Employer shall provide the Intern with advance notice of termination or\ncompensation in lieu of notice equal to 1 month.\nb. The Intern herself may terminate her Employment at any time by providing\nthe Employer with at least 1 month advance notice of his intention to resign.\nc. The Employment may terminate on the last day of the month in which the\ndate of the Intern’s death occurs; or the date on which the Company gives notice to the\nIntern if such termination is for Cause or Disability.\nd. For purposes of this Agreement, \"Cause\" means the Intern's gross\nmisconduct resulting in material damage to the Company, willful insubordination or\ndisobedience, theft, fraud or dishonesty, willful damage or loss of Employer’s property,\nbribery and habitual lateness or absence, or any other willful and material breach of this\nAgreement.\n12) Restrictive Covenant\nFollowing the termination of employment of the Intern by the Employer, with or without\ncause, or the voluntary withdrawal by the Intern from the Employer, the Intern shall, for a\nperiod of three years following the said termination or voluntary withdrawal, refrain from\neither directly or indirectly soliciting or attempting to solicit the business of any client or\ncustomer of the Employer for his own benefit or that of any third person or organization, and\nshall refrain from either directly or indirectly attempting to obtain the withdrawal from the\nemployment by the Employer of any other Intern of the Employer having regard to the same\ngeographic and temporal restrictions. The Intern shall not directly or indirectly divulge any\nfinancial information relating to the Employer or any of its affiliates or clients to any person\nwhatsoever.\n13) Non-Assignment\nThe interests of the Intern under this Agreement are not subject to the claims of his creditors\nand may not be voluntarily or involuntarily assigned, alienated or encumbered.\n13) Successors\nThis agreement shall be assigned by the Employer to any successor Employer and be binding\nupon the successor Employer. The Employer shall ensure that the successor Employer shall\ncontinue the provisions of this agreement as if it were the original party of the first part.\n6\n\n15) Indemnification\nThe Intern shall indemnify the Employer against any and all expenses, including amounts\npaid upon judgments, counsel fees, environmental penalties and fines, and amounts paid in\nsettlement (before or after suit is commenced), incurred by the Employer in connection with\nhis/her defense or settlement of any claim, action, suit or proceeding in which he/she is made\na party or which may be asserted against his/her by reason of his/her employment or the\nperformance of duties in this Agreement. Such indemnification shall be in addition to any\nother rights to which those indemnified may be entitled under any law, by-law, agreement, or\notherwise.\n16) Modification\nAny modification of this Agreement or additional obligation assumed by either party in\nconnection with this Agreement shall be binding only if evidenced in writing signed by each\nparty or an authorized representative of each party.\n17) Severability\nEach paragraph of this agreement shall be and remain separate from and independent of and\nseverable from all and any other paragraphs herein except where otherwise indicated by the\ncontext of the agreement. The decision or declaration that one or more of the paragraphs are\nnull and void shall have no effect on the remaining paragraphs of this agreement.\n18) Paragraph headings\nThe titles to the paragraphs of this Agreement are solely for the convenience of the parties\nand shall not be used to explain, modify, simplify, or aid in the interpretation of the\nprovisions of this Agreement.\n19) Applicable Law and Jurisdiction\nThis Agreement shall be governed by and construed in accordance with the laws of _____,\n_______. Each party hereby irrevocably submits to the exclusive jurisdiction of the courts\nof_______,_______, for the adjudication of any dispute hereunder or in connection herewith.\n20) Counterparts\nThe Agreement may be executed in two or more counterparts, any one of which shall be\ndeemed the original without reference to the others.\n7",
      "page_number": null,
      "method": "regex"
    },
    "non_compete_months": {
      "value": null,
      "confidence": 0.0,
      "source_text": null,
      "page_number": null,
      "method": "missing"
    },
    "probation_months": {
      "value": 1,
      "confidence": 0.9,
      "source_text": "Probation Period\na. The Intern shall be required to complete a minimum of three months of\ninternship with the Company, which shall commence on the date specified in the\nInternship Agreement.\nb. The Internship may be extended for a further period, subject to mutual\nagreement between the Intern and the Company.\nc. The Internship Agreement may be terminated by either party upon\nproviding a notice period of not less than 14 days, subject to the provisions specified in\nthe Internship Agreement.\n3) Compensation\nSubject to the following provisions of this Agreement, during the Internship Period, the\nIntern shall be compensated for his services as follows:\na. The Intern shall receive a monthly salary, payable in monthly or more\nfrequent installments, as per the convenience of the Employer, an amount of 6,000 per\nmonth, subject to such increases from time to time, as determined by the Employer. Such\npayments shall be subject to such normal statutory deductions by the Employer.\nb. During the term of this Agreement, the Intern's salary shall be paid by\nmeans of bank transfer, cheque, or any other method convenient to the Employer, and\nconsented to by the Intern.\nc. All reasonable expenses arising out of employment shall be reimbursed\nassuming that the same have been authorized prior to being incurred and with the\nprovision of appropriate receipts.\n4) Duties and Responsibilities:-\na) The Intern agrees that at all times during her employment with EuroIndia, she will\nfaithfully, industriously, and to the best of her skill, ability, experience and talent, perform\n2\n\nany and all of the duties required of her position, In carrying out these duties and\nresponsibilities, she shall comply with all policies, procedures, rules and regulations, both\nwritten and oral, as are announced or implemented by the Company from time to time, and\nshall honor and comply with all rules and statutory requirements under applicable law as\namended from time to time, in letter and spirit.\nb) The Intern’s unprofessional behavior or misconduct in violation of EuroIndia’s Code\nof Business Ethics and / or other organizational policies shall entitle the Company to take\nappropriate disciplinary action(s) including termination of your employment.\nc) The Intern, at all times, maintain satisfactory performance and upskill yourself in\naccordance with the business requirements of the Company. Unsatisfactory or poor\nperformance shall entitle Company to take appropriate disciplinary action(s) including\ntermination of her internship.\n5) Obligations of the Intern\na. Upon execution of agreement, the Intern shall not engage in any sort of\ntheft, fraud, misrepresentation or any other illegal act neither in the employment space\nnor outside the premise of employment. If he/she shall do so, the Company shall not be\nliable for such an act done at his own risk.\nb. The Intern further promises to never engage in any theft of the Employer’s\nproperty or attempt to defraud the Employer in any manner.\nc. The Intern shall always ensure that her conduct is in accordance with all the\nrules, regulations and policies of the Company as notified from time to time.\nd. The Intern shall not take up part-time or full-time employment or\nconsultation with any other party or be involved in any other business during the term of\nher employment with the Company.\ne. The Employer hereby prohibits the Intern from engaging in any sexual\nharassment and the Intern promises to refrain from any form of sexual harassment during\nthe course of employment in and around the premise of employment. If the Intern violates\nthis term in the agreement, he/she shall be fully responsible for his/her actions and the\nEmployer shall not be held responsible for any illegal acts committed at the discretion of\nthe Intern.\n6) Leave Policy\na. The Intern is entitled to 12 days of paid casual leaves in a year and 6 days\nof sick leave. In addition, the Intern will be entitled to public holidays mentioned under\nthe Leave Policy of the Employer.\n3\n\nb. The Intern shall not carry forward or encash any holiday to the next holiday\nyear.\nc. In the event if the Intern is absent from work due to sickness or injury, she\nshall inform the designated person as soon as possible and shall provide regular updates\nas to her recovery and as far as practicable will inform the designated person of the\nEmployer of expected date of return to work.\nd. If the Intern is absent from work due to sickness or injury for more than\nthree consecutive days the Intern must submit to the Employer a self-certification form. If\nsuch absence lasts for more than seven consecutive days the Intern must obtain a medical\ncertificate from his/her doctor and submit it to the Employer.\ne. For any period of absence due to sickness or injury the Intern will be paid\nstatutory sick pay only, provided that the Intern satisfy the relevant requirements. The\nIntern’s qualifying days for statutory sick pay purposes are Monday to Friday.\n7) Assignment\na. The Intern acknowledges that any work including without limitation\ninventions, designs, ideas, concepts, drawings, working notes, artistic works that the\nIntern may individually or jointly conceive or develop during the term of Employment are\n“works made for hire” and to the fullest extent permitted by law, Intern shall assign, and\ndoes hereby assign, to the Employer all of Intern's right, title and interest in and to all\nIntellectual Property improved, developed, discovered or written in such works.\nb. Intern shall, upon request of the Employer, execute, acknowledge, deliver\nand file any and all documents necessary or useful to vest in the Employer all of Intern's\nright, title and interest in and to all such matters.\nc. The tasks of the intern are as follows:\n-conducting market research\n-identifying business opportunities\n-managing email campaigns\n-generating sales leads\n-making cold calls\n-participating in meetings for lead conversion\n8) Competing Businesses\nDuring the Term of this Agreement and for a period of one (1) year after the termination of\nthis Agreement the Intern shall not engage in any employment, consulting, or other activity\n4\n\nthat competes with the business, proposed business or business interests of the Employer,\nwithout the Employer’s prior written consent.\n9) Confidentiality\na. The Intern acknowledges that, in the course of performing and fulfilling\nyour duties hereunder, the Intern may have access to and be entrusted with confidential\ninformation concerning the present and contemplated financial status and activities of the\nEmployer, the disclosure of any of which confidential information to the competitors of\nthe Employer would be highly detrimental to the interests of the Employer.\nb. The Intern further acknowledges and agrees that the right to maintain the\nconfidentiality of trade secrets, source code, website information, business plans or client\ninformation or other confidential or proprietary information, for the purpose of enabling\nthe other party such information constitutes a proprietary right which the Employer is\nentitled to protect.\nc. Accordingly, the Intern covenants and agrees with the Employer that she\nwill not, under any circumstance during the continuance of this agreement, disclose any\nsuch confidential information to any person, firm or corporation, nor shall she use the\nsame, except as required in the normal course of his engagement hereunder, and even\nafter the termination of employment, she shall not disclose or make use of the same or\ncause any of confidential information to be disclosed in any manner.\nd. The Employer owns any intellectual property created by the Intern during\nthe course of the employment, or in relation to a certain field, and he shall thereon have\nall the necessary rights to retain it. After termination of employment, Intern shall not\nimpose any rights on the intellectual property created. Any source code, software or other\nintellectual property developed, including but not limited to website design or\nfunctionality that was created by the Intern, during the course of employment under this\nAgreement, shall belong to the Employer.\n10) Remedies\nIf at any time the Intern violates any of the covenants or agreements set forth in paragraphs 4\nor 5 or 8, the Company shall have the right to terminate all of its obligations to make further\npayments under this Agreement. The Intern acknowledges that the Company would be\nirreparably injured by a violation of paragraphs4 or 5 or 8 and agrees that the Company\nshall be entitled to an injunction restraining you from any actual or threatened breach of\nparagraphs 4 or 5 or 8 or to any other appropriate equitable remedy without any bond or other\nsecurity being required.\n5\n\n11) Amendment and Termination\na. In case the Employer terminates the employment without just cause, in\nwhich case the Employer shall provide the Intern with advance notice of termination or\ncompensation in lieu of notice equal to 1 month",
      "page_number": 2,
      "method": "regex"
    },
    "extracted_clauses": {
      "termination": {
        "text": "5) Obligations of the Intern\na. Upon execution of agreement, the Intern shall not engage in any sort of\ntheft, fraud, misrepresentation or any other illegal act neither in the employment space\nnor outside the premise of employment. If he/she shall do so, the Company shall not be\nliable for such an act done at his own risk.\nb. The Intern further promises to never engage in any theft of the Employer’s\nproperty or attempt to defraud the Employer in any manner.\nc. The Intern shall always ensure that her conduct is in accordance with all the\nrules, regulations and policies of the Company as notified from time to time.\nd. The Intern shall not take up part-time or full-time employment or",
        "evidence": {
          "value": 689,
          "confidence": 0.7,
          "source_text": "termination of her internship.\n5) Obligations of the Intern\na. Upon execution of agreement, the Intern shall not engage in any sort",
          "page_number": 3,
          "method": "regex"
        }
      },
      "ip": {
        "text": "b. Intern shall, upon request of the Employer, execute, acknowledge, deliver\nand file any and all documents necessary or useful to vest in the Employer all of Intern's\nright, title and interest in and to all such matters.\nc. The tasks of the intern are as follows:\n-conducting market research\n-identifying business opportunities\n-managing email campaigns\n-generating sales leads\n-making cold calls\n-participating in meetings for lead conversion\n8) Competing Businesses\nDuring the Term of this Agreement and for a period of one (1) year after the termination of\nthis Agreement the Intern shall not engage in any employment, consulting, or other activity\n4\n\nthat competes with the business, proposed business or business interests of the Employer,\nwithout the Employer’s prior written consent.\n9) Confidentiality\na. The Intern acknowledges that, in the course of performing and fulfilling\nyour duties hereunder, the Intern may have access to and be entrusted with confidential",
        "evidence": {
          "value": 974,
          "confidence": 0.7,
          "source_text": "Intellectual Property improved, developed, discovered or written in such works.\nb. Intern shall, upon request of the Employer, execute, acknowledge, deliver\nand file any and all do",
          "page_number": 4,
          "method": "regex"
        }
      },
      "confidentiality": {
        "text": "information or other confidential or proprietary information, for the purpose of enabling",
        "evidence": {
          "value": 89,
          "confidence": 0.7,
          "source_text": "confidentiality of trade secrets, source code, website information, business plans or client\ninformation or other confidential or proprietary information, for the purpose of enabling",
          "page_number": 5,
          "method": "regex"
        }
      }
    }
  },
  "num_chunks": 34
}